[
    {
        "title": "Medics fight war injuries without power in Ukraine",
        "image": null,
        "video": null,
        "description": "Since Russia retreated from the Kherson nearly two weeks ago, cutting water and power lines in its wake, doctors say caring for patients is becoming harder, especially as attacks increase. (Nov 25)      ",
        "content": null,
        "link": "http://rssfeeds.usatoday.com/~/720307908/0/usatodaycomnation-topstories~Medics-fight-war-injuries-without-power-in-Ukraine/",
        "probability_title": {
            "pos": 0.716415724616027,
            "neg": 0.2835842753839731
        },
        "probability_description": {
            "pos": 0.6290300440464123,
            "neg": 0.3709699559535877
        }
    },
    {
        "title": "Gunman in Virginia Walmart shooting 'was going hunting,' witness says; motive for attack still unknown: What we know",
        "image": "https://www.gannett-cdn.com/presto/2022/11/23/USAT/9cdcab50-dda5-4d36-acd3-5d2a915d95df-walmart_shooting.jpg",
        "video": null,
        "description": "Investigators were \"actively working\" on Thanksgiving to determine a motive in a shooting that killed six at a Walmart, Chesapeake police said.       ",
        "content": "CHESAPEAKE, Va. – The shooter who killed six people at a Walmart in Virginia late Tuesday was targeting co-workers, \"going hunting'' and making sure they were dead, according to a witness. Jessica Wilczewski said overnight team leader Andre Bing came into the break room before the late shift started and opened fire with a purpose, contradicting the account of another witness who said the gunman shot wildly. “The way he was acting – he was going hunting,” Wilczewski told The Associated Press on Thursday. “The way he was looking at people’s faces and the way he did what he did, he was picking people out.” Wilczewski, who had worked at the store only a few days, said the gunman let her go when he recognized her, but fired again at other employees he had already hit and were down. “What I do know is that he made sure who he wanted dead, was dead,” she said. “He went back and shot dead bodies that were already dead. To make sure.” On Wednesday, fellow Walmart worker Briana Tyler had said Bing \"was just shooting all throughout the room. It didn’t matter who he hit.'' Police said Bing, who had a handgun and multiple magazines, was found dead in the break room from a likely self-inflicted gunshot wound. Bing, 31, had been a Walmart employee since 2010, the company said. WAVY-TV 10 in Portsmouth, Virginia, reported that Bing left behind a \"manifesto.'' Chesapeake police spokesman Leo Kosinski said investigators are looking into the report. Police investigating motive for attack Authorities worked Thursday to determine a motive in the shooting that killed six people and injured at least six others. The city of Chesapeake said Thursday that two of the injured remain hospitalized, one in critical condition and the other one in fair/improving condition. Police and witnesses say Bing pulled out a handgun Tuesday night before an employee meeting and began firing in the break room. It was the country’s second high-profile mass shooting in four days. On Thanksgiving, first responders were still at the site of the shooting, local truck driver Zachary Adkins told USA TODAY. Adkins said he drove to the Walmart – which remained closed – Thursday morning to try to buy a meal for the responders, who politely declined. “Just wanted to come out here, pay our respects, because it’s Thanksgiving,\" he said. \"And some people aren’t going to have their family.” Police investigate possible motive Investigators had not determined a motive in the shooting as of Thursday morning, but were \"actively working on it,\" Kosinski said. The FBI's Norfolk field office is assisting Chesapeake police with the investigation. The city of Chesapeake previously said in a news release that a SWAT team \"executed a search warrant at the suspect's residence and with the help of Virginia State Police cleared the house.\" Who were the victims? Authorities released the names of all but one of the victims Wednesday. Walmart confirmed all those killed, who ranged in age from 16 to 70, were employees. Police said the name of a 16-year-old boy who was killed is being withheld because of his age. The other victims were identified as Brian Pendleton, 38; Kellie Pyle, 52; Lorenzo Gamble, 43; and Randy Blevins, 70, who were all from Chesapeake; and Tyneka Johnson, 22, of nearby Portsmouth. Many had been longtime Walmart employees, and one planned to retire next year. Jasmine Rankins, a former employee at the Walmart store, told USA TODAY that Pendleton had been \"a really good friend\" since 2018 and that the two would always joke and laugh together. Rankins said she and her husband saw Pendleton at the Walmart last week, and she promised to give him a present for his coming birthday. A makeshift memorial to Johnson was placed in a grassy area outside the Walmart with the words, “Our Hearts are with you” and a basket of flowers. The remembrance included a cluster of blue, white and gold balloons tied to a tree, alongside a yellow line of police tape. Pyle was remembered as a generous and kind person, a mother who had wedding plans in the near future. “She was going to marry my son next year. She was an awesome, kind individual,” said Gwendolyn Bowe Baker Spencer. Pyle had adult children in Kentucky who will be traveling to Virginia in the wake of the tragedy, Spencer said. Blevins was a longtime member of the store’s team that set prices and arranged merchandise, The New York Times reported . Gamble was a Walmart employee for 15 years, his mother, Linda Gamble, told the Washington Post. Gamble came from a big family and was planning a Thanksgiving dinner with his mother, Linda Gamble said. “I just wanted my boys to spend time with me,” Gamble told the Post. She and her husband, Alonzo Gamble, said Lorenzo was quiet and reserved but loved spending time with his two sons, according to the Post. Chesapeake community mourns Walmart set up a resource center for store associates and their family members, the city of Chesapeake said on Twitter . Chesapeake locals will \"share this burden together\" and be stronger for it, Mayor Rick West said in a video statement Wednesday , adding that support is already pouring in from around the country. \"I know this community and I know it well, and I know that we will come together and lend a helping hand to the victims' families,\" West said. Rebecca Cowan, a licensed counselor, came to the memorial outside the Walmart to leave a small bouquet of flowers. She teaches a Walden University course about trauma and responds to mass shootings with the Red Cross. “I think it’s important to recognize that entire communities are impacted by this,” she said, adding that the effects ripple outward through the area. Who was the shooter? Walmart said Bing was a \"team leader\" who had worked for the company since 2010. A search of local and state court records did not bring up any criminal charges against Bing. USA TODAY could not locate any social media pages for him. The Washington Post quoted one unnamed former colleague saying Bing had told her he had “anger issues” and another one calling him “overly aggressive.” Others, however, described him as friendly and not the prototype of someone who would launch such an attack. What we know about the gunman: Virginia Walmart manager fatally shoots 6 Contributing: Thao Nguyen, Kayla Jimenez, Joel Shannon, USA TODAY; The Associated Press",
        "link": "http://rssfeeds.usatoday.com/~/720287570/0/usatodaycomnation-topstories~Gunman-in-Virginia-Walmart-shooting-was-going-hunting-witness-says-motive-for-attack-still-unknown-What-we-know/",
        "probability_title": {
            "pos": 0.44151772280045054,
            "neg": 0.5584822771995495
        },
        "probability_description": {
            "pos": 0.8167852323655939,
            "neg": 0.18321476763440614
        }
    },
    {
        "title": "Completely transform a room for less than $20: The perfect gift for space lovers",
        "image": "http://cdn.mos.cms.futurecdn.net/wYXeoNTcuMiFZaRKsfEYYW.jpg",
        "video": null,
        "description": "With a 60% Black Friday discount you can't go far wrong with the BlissLights Sky Lite Star Projector from Walmart.",
        "content": null,
        "link": "https://www.space.com/blisslights-sky-lite-star-projector-save-60-black-friday-deals-2022",
        "probability_title": {
            "pos": 0.6683465989417557,
            "neg": 0.33165340105824426
        },
        "probability_description": {
            "pos": 0.6532306290802526,
            "neg": 0.34676937091974736
        }
    },
    {
        "title": "Heavy rain to blanket much of the southern U.S. on holiday weekend; New Mexico gets massive snowfall",
        "image": "https://www.gannett-cdn.com/presto/2022/11/24/USAT/7f1ea4ff-b2c9-4758-abae-569668752cff-Screen_Shot_2022-11-24_at_3.44.18_PM.png",
        "video": null,
        "description": "Parts of Texas, Louisiana and Arkansas were blanketed with rain Thursday and another round of showers is anticipated tomorrow, forecasters say.       ",
        "content": "Strong and steady rain could complicate the plans of Thanksgiving travelers and Black Friday shoppers as an enormous storm is expected to sweep across much of the southern U.S. starting Thursday night. Parts of Texas, Louisiana and Arkansas were already blanketed with rain by Thursday afternoon and another round of showers is anticipated tomorrow, forecasters say. The massive system is also expected to bring snow to eastern New Mexico and western Texas. The dayslong storm is being driven by a ball of low pressure that settled over southeastern New Mexico after passing through the Rocky Mountains, National Weather Service meteorologist Marc Chenard told USA TODAY. “As the system dove south and east across the Rockies that’s when it kind of intensified,\" Chenard said. Usually, similar weather systems move with the jet streams and travel quickly from west to east across the country, Chenard said. But this system \"separated from the northern stream\" and \"because it was no longer connected with that westerly flow it slowed down and kind of closed off and became this closed low that we’re seeing.” As a result, parts of New Mexico and Texas could see four to eight inches of snow Thursday night, the National Weather Service said . The more isolated snowy precipitation is a relatively extreme event for the region, Chenard said. “This is a pretty heavy snow for southeast New Mexico, some areas could be approaching November records with this system,\" he said. The weather service on Thursday morning warned travelers in New Mexico and Texas, saying on Twitter , \"Be sure to plan ahead if traveling as roads, and especially bridges and overpasses, will likely become slick and hazardous.\" Further east, travelers and holiday shoppers have been warned delays could unfold due to flooding from rain. From Thursday through Sunday, an area stretching across the entire southeast could get four to six inches of rain, with the rainiest spots possibly hit with up to 12 inches, AccuWeather forecasters predicted . \"As the storm evolves from Thursday to Friday, rain will fill up some rain gauges in the lower Mississippi Valley and Southeast, especially from eastern Texas to northern Georgia, upstate South Carolina and western North Carolina,\" AccuWeather Senior Meteorologist Bill Deger said. After Thursday's downpour, states in the southeast will get a second round of rain dumped on them F, Chenard said. “It’s going to reload and there will be another round that develops tomorrow,\" he said. The risk of flash flooding is highest in southeast Texas, according to National Weather Service forecasts. People traveling in parts of Louisiana should also take care to avoid roadways that are flooded over, Chenard said.",
        "link": "http://rssfeeds.usatoday.com/~/720294472/0/usatodaycomnation-topstories~Heavy-rain-to-blanket-much-of-the-southern-US-on-holiday-weekend-New-Mexico-gets-massive-snowfall/",
        "probability_title": {
            "pos": 0.633126243390788,
            "neg": 0.36687375660921195
        },
        "probability_description": {
            "pos": 0.7226667797380613,
            "neg": 0.2773332202619388
        }
    },
    {
        "title": "Preparing your business for climate risk disclosure regulations",
        "image": null,
        "video": null,
        "description": "Businesses must prepare for the coming climate impact disclosure regulations — and ensure that their partners and suppliers are, as well.",
        "content": "Businesses must prepare for the coming climate impact disclosure regulations — and ensure that their partners and suppliers are, as well.Read More",
        "link": "https://venturebeat.com/data-infrastructure/preparing-your-business-for-climate-risk-disclosure-regulations/",
        "probability_title": {
            "pos": 0.6073402086255223,
            "neg": 0.3926597913744777
        },
        "probability_description": {
            "pos": 0.8292753714589074,
            "neg": 0.1707246285410926
        }
    },
    {
        "title": "Webb Space Telescope spots early galaxies hidden from Hubble",
        "image": "https://scx1.b-cdn.net/csz/news/tmb/2022/webb-space-telescope-s.jpg",
        "video": null,
        "description": "NASA's Webb Space Telescope is finding bright, early galaxies that until now were hidden from view, including one that may have formed a mere 350 million years after the cosmic-creating Big Bang.",
        "content": null,
        "link": "https://phys.org/news/2022-11-webb-space-telescope-early-galaxies.html",
        "probability_title": {
            "pos": 0.7059815890825947,
            "neg": 0.29401841091740527
        },
        "probability_description": {
            "pos": 0.7581293174608545,
            "neg": 0.2418706825391454
        }
    },
    {
        "title": "73% discount on Astronaut star projectors this Black Friday",
        "image": "http://cdn.mos.cms.futurecdn.net/WMRCf3qZqmBBUAxntiuX7e.jpg",
        "video": null,
        "description": "Grab a supermassive 73% discount this Black Friday with this astronaut star projectorand add an out-of-this-world aesthetic to your room.",
        "content": null,
        "link": "https://www.space.com/astronaut-star-projector-black-friday-deal-save-30-percent",
        "probability_title": {
            "pos": 0.5684062036466012,
            "neg": 0.4315937963533988
        },
        "probability_description": {
            "pos": 0.6998242277384291,
            "neg": 0.3001757722615709
        }
    },
    {
        "title": "10 best Black Friday telescope deals we've seen so far 2022",
        "image": "http://cdn.mos.cms.futurecdn.net/ECrhGWLo6ewH8C9zUC4kQN.jpg",
        "video": null,
        "description": "With Black Friday deals coming thick and fast we've rounded up our top 10 telescope deals so you don't have to go searching.",
        "content": null,
        "link": "https://www.space.com/10-best-black-friday-telescope-deals-2022",
        "probability_title": {
            "pos": 0.5989335046674922,
            "neg": 0.4010664953325078
        },
        "probability_description": {
            "pos": 0.6686280305970023,
            "neg": 0.33137196940299773
        }
    },
    {
        "title": "Spectacular floats and inflatables at Macy's parade",
        "image": null,
        "video": null,
        "description": "Hundreds of spectators lined the streets of New York on Thursday as colorful, high-flying balloons helped usher in the holiday season during the Macy's Thanksgiving Day Parade. (Nov. 24) (AP Video: Ted Shaffrey)      ",
        "content": null,
        "link": "http://rssfeeds.usatoday.com/~/720291008/0/usatodaycomnation-topstories~Spectacular-floats-and-inflatables-at-Macys-parade/",
        "probability_title": {
            "pos": 0.7669796189938511,
            "neg": 0.2330203810061489
        },
        "probability_description": {
            "pos": 0.6932166748320632,
            "neg": 0.3067833251679368
        }
    },
    {
        "title": "Ryan Coogler Shares Note Thanking Fans for 'Black Panther: Wakanda Forever' Success",
        "image": "https://img.buzzfeed.com/buzzfeed-static/static/2022-11/24/20/tmp/2cc870c298aa/tmp-name-3-5018-1669320717-3_dblbig.jpg",
        "video": null,
        "description": "Ryan Coogler shared a heartfelt thanking fans for making his latest film, 'Black Panther: Wakanda Forever, ​​​​​​​' a huge box office success.View Entire Post ›",
        "content": null,
        "link": "https://www.complex.com/pop-culture/a/backwoodsaltar/ryan-coogler-thanks-fans-for-black-panther-2-success",
        "probability_title": {
            "pos": 0.5904139220883341,
            "neg": 0.4095860779116659
        },
        "probability_description": {
            "pos": 0.606636443359966,
            "neg": 0.3933635566400339
        }
    },
    {
        "title": "To stop new viruses jumping across to humans, we must protect and restore bat habitat",
        "image": "https://scx1.b-cdn.net/csz/news/tmb/2022/to-stop-new-viruses-ju.jpg",
        "video": null,
        "description": "Bats have lived with coronaviruses for millennia. Details are still hazy about how one of these viruses evolved into SARS-CoV-2, which causes COVID in humans. Did it go directly from bats to humans or via another animal species? When? And why? If we can't answer these questions for this now-infamous virus, we have little hope of preventing the next pandemic.",
        "content": null,
        "link": "https://phys.org/news/2022-11-viruses-humans-habitat.html",
        "probability_title": {
            "pos": 0.7040135783641691,
            "neg": 0.2959864216358309
        },
        "probability_description": {
            "pos": 0.6789080104897656,
            "neg": 0.32109198951023443
        }
    },
    {
        "title": "Celestron PowerSeeker 50 AZ now under $50 for Black Friday",
        "image": "http://cdn.mos.cms.futurecdn.net/MLMdrq9f3RJyeneG2KYU7A.jpg",
        "video": null,
        "description": "Grab 22% off the Celestron PowerSeeker 50 AZ refractor telescope and get it for under $50 in this Black Friday deal.",
        "content": null,
        "link": "https://www.space.com/celestron-powerseeker-save-22-percent-black-friday-deal",
        "probability_title": {
            "pos": 0.5524650636593105,
            "neg": 0.4475349363406895
        },
        "probability_description": {
            "pos": 0.5843439336845226,
            "neg": 0.4156560663154773
        }
    },
    {
        "title": "Webb telescope reveals blazing hourglass around forming star",
        "image": "https://scx1.b-cdn.net/csz/news/tmb/2022/the-colourful-clouds-a.jpg",
        "video": null,
        "description": "The James Webb Space Telescope unveiled its latest image of celestial majesty on Wednesday, an ethereal hourglass of orange and blue dust being shot out from a newly forming star at its center.",
        "content": null,
        "link": "https://phys.org/news/2022-11-webb-telescope-reveals-blazing-hourglass.html",
        "probability_title": {
            "pos": 0.5921513741250318,
            "neg": 0.4078486258749682
        },
        "probability_description": {
            "pos": 0.7163881568659312,
            "neg": 0.28361184313406884
        }
    },
    {
        "title": "How AI and crowdsourcing help social scientists sample diverse populations",
        "image": null,
        "video": null,
        "description": "Originally designed to assist machine learning engineers, crowdsourcing platforms are gradually changing the way social sciences operate.",
        "content": "Originally designed to assist machine learning engineers, crowdsourcing platforms are gradually changing the way social sciences operate.Read More",
        "link": "https://venturebeat.com/business/how-ai-and-crowdsourcing-help-social-scientists-sample-diverse-populations/",
        "probability_title": {
            "pos": 0.7162085222469889,
            "neg": 0.28379147775301106
        },
        "probability_description": {
            "pos": 0.768998895550282,
            "neg": 0.23100110444971794
        }
    },
    {
        "title": "Increased grazing pressure threatens the most arid rangelands",
        "image": "https://scx1.b-cdn.net/csz/news/tmb/2022/increased-grazing-pres-2.jpg",
        "video": null,
        "description": "A new study published in Science reports results from the first-ever global field assessment of the ecological impacts of grazing in drylands. An international research team has found that grazing can have positive effects on ecosystem services, particularly in species-rich rangelands, but these effects turn to negative under a warmer climate.",
        "content": null,
        "link": "https://phys.org/news/2022-11-grazing-pressure-threatens-arid-rangelands.html",
        "probability_title": {
            "pos": 0.6594317547112531,
            "neg": 0.3405682452887469
        },
        "probability_description": {
            "pos": 0.7366843603056983,
            "neg": 0.2633156396943018
        }
    },
    {
        "title": "A light-powered catalyst could be key for hydrogen economy",
        "image": "https://scx1.b-cdn.net/csz/news/tmb/2022/rice-labs-catalyst-cou.jpg",
        "video": null,
        "description": "Rice University researchers have engineered a key light-activated nanomaterial for the hydrogen economy. Using only inexpensive raw materials, a team from Rice's Laboratory for Nanophotonics, Syzygy Plasmonics Inc. and Princeton University's Andlinger Center for Energy and the Environment created a scalable catalyst that needs only the power of light to convert ammonia into clean-burning hydrogen fuel.",
        "content": null,
        "link": "https://phys.org/news/2022-11-light-powered-catalyst-key-hydrogen-economy.html",
        "probability_title": {
            "pos": 0.6165553935200946,
            "neg": 0.3834446064799054
        },
        "probability_description": {
            "pos": 0.7033136370150167,
            "neg": 0.2966863629849833
        }
    },
    {
        "title": "Fenix Games raises $150M for blockchain game publishing",
        "image": null,
        "video": null,
        "description": "Fenix Games has raised $150 million to create a new kind of publisher for blockchain gaming.",
        "content": "Fenix Games has raised $150 million to create a new kind of publisher for blockchain gaming.Read More",
        "link": "https://venturebeat.com/games/fenix-games-raises-150m-for-blockchain-game-publishing/",
        "probability_title": {
            "pos": 0.6878373542918428,
            "neg": 0.31216264570815716
        },
        "probability_description": {
            "pos": 0.6177472168916698,
            "neg": 0.3822527831083302
        }
    },
    {
        "title": "Overfished lobster found to grow bigger in protected areas",
        "image": "https://scx1.b-cdn.net/csz/news/tmb/2022/overfished-lobster-fou.jpg",
        "video": null,
        "description": "A team of researchers at the University of Agder's, Center for Coastal Research, working with a colleague at the Institute of Marine Research, both in Norway, has found that when protected areas for lobsters are established in overfished parts of the sea, the lobsters tend to grow bigger. In their paper published in Proceedings of the Royal Society B, the group describes their study of lobsters inside and outside of protected zones off the coast of Norway.",
        "content": null,
        "link": "https://phys.org/news/2022-11-overfished-lobster-bigger-areas.html",
        "probability_title": {
            "pos": 0.6304573600289456,
            "neg": 0.3695426399710544
        },
        "probability_description": {
            "pos": 0.7674672178439507,
            "neg": 0.23253278215604933
        }
    },
    {
        "title": "This is the way... to get Lego Mandalorian sets for 20% off during Black Friday",
        "image": "http://cdn.mos.cms.futurecdn.net/t8bvkUmaGN8N2KuV9AWPEB.jpg",
        "video": null,
        "description": "Are you a fan of Star Wars' shiniest bounty hunter? Get this LEGO Star Wars The Mandalorian's N-1 Starfighter and Mandalorian Helmet for 20% off at Best Buy.",
        "content": null,
        "link": "https://www.space.com/get-two-fantastic-the-mandalorian-lego-star-wars-sets-for-20-off-at-best-buy",
        "probability_title": {
            "pos": 0.6153290443222481,
            "neg": 0.38467095567775184
        },
        "probability_description": {
            "pos": 0.6976588441516283,
            "neg": 0.3023411558483718
        }
    },
    {
        "title": "How to fix insecure operational tech that threatens the global economy",
        "image": null,
        "video": null,
        "description": "The market is ripe for a security mechanism for operational tech (OT) with strong, embedded protection, high fault tolerance and low cost.",
        "content": "The market is ripe for a security mechanism for operational tech (OT) with strong, embedded protection, high fault tolerance and low cost.Read More",
        "link": "https://venturebeat.com/security/how-to-fix-insecure-operational-technology-threatens-global-economy/",
        "probability_title": {
            "pos": 0.7772018821808244,
            "neg": 0.22279811781917558
        },
        "probability_description": {
            "pos": 0.6098438692684969,
            "neg": 0.3901561307315031
        }
    },
    {
        "title": "$50 discount on the Encalife ENTE501P refractor telescope",
        "image": "http://cdn.mos.cms.futurecdn.net/FQodSMjpFrY33dASLkgYec.jpg",
        "video": null,
        "description": "20% Black Friday discount on the Encalife ENTE501P refractor telescope makes this entry-level telescope $50 cheaper then its original price.",
        "content": null,
        "link": "https://www.space.com/50-dollar-discount-encalife-ente501p-black-friday-telescope-deal-2022",
        "probability_title": {
            "pos": 0.7884205415683763,
            "neg": 0.21157945843162368
        },
        "probability_description": {
            "pos": 0.6429410537539756,
            "neg": 0.3570589462460244
        }
    },
    {
        "title": "\"Black Panther: Wakanda Forever\" continues the series’ quest to recover and celebrate lost cultures",
        "image": "https://media.salon.com/2022/11/black_panther_wakanda_forever_still_04_tenoch_huerta_mejia.jpg",
        "video": null,
        "description": "Taking cues from Afrofuturism, the film highlights the legacy of Mesoamerican culture destroyed by colonization",
        "content": "-- Shares Facebook Twitter Reddit Email view in app This article was originally published on The Conversation . As someone who teaches and writes about Afrofuturism , I've been eagerly awaiting the release of \" Black Panther: Wakanda Forever .\" I'm particularly excited about the introduction of Namor and the hidden kingdom of Talokan, which he leads. The first \" Black Panther \" film adhered to a longstanding practice in Afrofuturist stories and art by engaging in what I call \"acts of recovery\" – the process of reviving and celebrating elements of Black culture that were destroyed or suppressed by colonization. This practice is often linked to \" Sankofa ,\" an African word from the Akan tribe in Ghana that roughly translates to \"it is not taboo to fetch what is at risk of being left behind.\" \"Wakanda Forever\" pulls from the past in the same way, but with a twist: Talokan is inspired not by African cultures, but by Mesoamerica , a vast area that covers most of Central America and part of Mexico. A theory of time The idea that African knowledge and contributions to science and culture have been erased and must be recovered is central to Afrofuturism. The term, which was coined in 1994 , describes a cultural movement that pulls from elements of science fiction, magical realism, speculative fiction and African history. On its home page, the Afrofurist listserv , an email list organized by social scientist Alondra Nelson in 1998, pointed to this process of recovery as a central tenet of the genre: \"Once upon a time, in the not-so-distant past, cultural producers of the African diaspora composed unique visions on the world at hand and the world to come. This speculation has been called AfroFuturism – cultural production that simultaneously references a past of abduction, displacement and alien-nation; celebrates the unique aesthetic perspectives inspired by these fractured histories; and imagines the possible futures of black life and ever-widening definitions of 'blackness.'\" This fascination with uncovering the ways in which Black contributions have been erased and suppressed means that Afrofuturist works often mine the past as a first step toward creating visions of the future. Afrofuturist scholars such as Kinitra Brooks even describe Afrofuturism as a theory of time . For her, the \"present, past, and future\" exist together, creating the opportunity to push against the systemic devaluation of Black people that occurred during slavery and Jim Crow segregation, and persists in contemporary anti-Black violence. Looking back to see tomorrow This recovery can take many forms. Several Black writers published serialized novels of speculative fiction, such as Martin R. Delany's \" Blake: Or the Huts of America ,\" a slave revolt story written between 1859 and 1861. Pauline Hopkins' \" Of One Blood: Or, the Hidden Self ,\" published in 1903, tells the story of mixed-race Harvard medical students who discover Telassar, a hidden city in Ethiopia, home to an advanced society possessing technology and mystical powers. Both narratives refuse to depict Black culture as backwards or impotent, and instead celebrate Black empowerment and the rich cultural legacies of Black people. Curator Ingrid Lafleur has long talked about how Afrofuturist visual aesthetics relies on recovering ancient African cosmology . You can see this practice in the work of musical artists such as Sun Ra , who used Egyptian symbolism throughout his work, and visual artists such as Kevin Sipp , who remixes and reimagines African cultural symbolism to create sculptures and visual work that fuse past styles and symbols with contemporary practices. Simply put, a reverence for ancestral knowledge and culture is the beating heart of Afrofuturism, and has become an integral part of Afrofuturism's mission to forge a better future. Mesoamerica takes center stage The first \"Black Panther\" film celebrated an array of African cultures. Costume designer Ruth Carter deliberately infused elements from across the continent in every scene . For example, the headdress worn by Queen Ramonda, played by Angela Bassett, was inspired by the isicholo , a South African hat traditionally associated with married women. And Lupita Nyong'o's Nakia wore clothing inspired by the Suri tribe . And so the film highlighted African cultures not by depicting them as fragile or foundering, but as paragons of artistry and sophistication. In \"Black Panther: Wakanda Forever,\" these themes are explored both in the way the mantle of Black Panther presumably passes to Princess Shuri, and in the depiction of Namor and the kingdom of Talokan. While Talokan is an underwater society inspired by the myth of Atlantis , Marvel Studios has signaled that the people of Talokan sought refuge underwater in response to colonial invasion. By invoking the complexities of this history – and seemingly leaning heavily on parallels to Mayan culture – the film celebrates a society that scholarship has long noted for its achievements in architecture , mathematics , astronomy and language . History books reference these accomplishments . But in popular culture, there's little attention given to this cultural landscape. Namor and the kingdom he leads are poised to remind a global audience of the rich world of Mesoamerica that thrived – until European contact beginning in 1502 led to conquest, decline and eradication. Today, immigration, trade and drug trafficking dominate discussions of Central America and Mexico in the U.S. media. This film, on the other hand, invites the viewer to appreciate the profound cultural legacy of Mexican and Central American civilizations. Julian C. Chambliss , Professor of English, Michigan State University This article is republished from The Conversation under a Creative Commons license. By Julian C. Chambliss MORE FROM Julian C. Chambliss Related Topics ------------------------------------------ Black Panther Black Panther Wakanda Forever Colonialism Commentary Mayan Mesoamerica Movies Wakanda Forever Related Articles Advertisement: Advertisement: Trending Articles from Salon Advertisement: Advertisement:",
        "link": "https://www.salon.com/2022/11/24/black-panther-wakanda-forever-continues-the-series-quest-to-recover-and-celebrate-lost-cultures_partner/",
        "probability_title": {
            "pos": 0.6779327632711527,
            "neg": 0.3220672367288473
        },
        "probability_description": {
            "pos": 0.777592547083101,
            "neg": 0.222407452916899
        }
    },
    {
        "title": "Study reveals intensive grassland management hampers recovery of soil food webs from drought",
        "image": "https://scx1.b-cdn.net/csz/news/tmb/2022/study-reveals-intensiv.jpg",
        "video": null,
        "description": "New research led by a team of scientists from The University of Manchester has shown that intensive grassland management impairs the capacity of soils to buffer extreme droughts, which are becoming more frequent and intense.",
        "content": null,
        "link": "https://phys.org/news/2022-11-reveals-intensive-grassland-hampers-recovery.html",
        "probability_title": {
            "pos": 0.7316887521600065,
            "neg": 0.2683112478399935
        },
        "probability_description": {
            "pos": 0.776508143326565,
            "neg": 0.2234918566734349
        }
    },
    {
        "title": "Possible organic compounds found in Mars crater rocks",
        "image": "https://scx1.b-cdn.net/csz/news/tmb/2022/possible-organic-compo.jpg",
        "video": null,
        "description": "A study published in Science analyses multiple rocks found at the bottom of Jezero Crater on Mars, where the Perseverance rover landed in 2020, revealing significant interaction between the rocks and liquid water. Those rocks also contain evidence consistent with the presence of organic compounds.",
        "content": null,
        "link": "https://phys.org/news/2022-11-compounds-mars-crater.html",
        "probability_title": {
            "pos": 0.6102223311772305,
            "neg": 0.38977766882276954
        },
        "probability_description": {
            "pos": 0.8081007421095947,
            "neg": 0.19189925789040535
        }
    },
    {
        "title": "Watch fiery separation of NASA's moon rocket boosters",
        "image": "http://cdn.mos.cms.futurecdn.net/D5PcFMivjchPGwToYTqyFH.jpg",
        "video": null,
        "description": "NASA has released a video taken by a camera on board the Space Launch System moon rocket showing the fiery separation of the rocket's two strap-on boosters shortly after lift-off.",
        "content": null,
        "link": "https://www.space.com/nasa-moon-rocket-sheds-boosters-video",
        "probability_title": {
            "pos": 0.8268371860771019,
            "neg": 0.17316281392289812
        },
        "probability_description": {
            "pos": 0.8770934873448774,
            "neg": 0.12290651265512265
        }
    },
    {
        "title": "JWST peers into the atmosphere of an exoplanet bombarded by stellar radiation",
        "image": null,
        "video": null,
        "description": null,
        "content": "An artist’s illustration of WASP 39-b. | Image: NASA, ESA, CSA, Joseph Olmsted (STScI) This week, astronomers announced that they’d found evidence of chemical reactions in the atmosphere of an exoplanet 700 light years away from Earth. Researchers using the James Webb Space Telescope created a detailed chemical portrait of the scorching gases swirling around exoplanet WASP-39b. This “hot Saturn” planet orbits extremely close to its host star, meaning it has high temperatures of up to 1,600 degrees Fahrenheit or 900 degrees Celsius. It is also puffy, with around one quarter the mass of Jupiter but 1.3 times its size. Early data about WASP-39b was shared this summer when JWST detected carbon dioxide in its atmosphere — the first time this gas had been detected on a planet outside our solar system. Now, a more detailed picture of its atmosphere has been painted in a series of papers posted recently on arXiv, three of which have been accepted for publication in Nature and two of which are under review, as part of a program designed to quickly release observations and data made by the telescope to scientists around the world. The researchers used three of Webb’s instruments, NIRSpec, NIRCam, and NIRISS, to collect spectroscopy information about the planet’s atmosphere. “We observed the exoplanet with several instruments that together cover a broad swath of the infrared spectrum and a panoply of chemical fingerprints inaccessible until JWST,” said one of the researchers, Natalie Batalha of the University of California, Santa Cruz, in a statement. “Data like these are a game changer.” In the last decade, astronomy researchers have discovered a plethora of exoplanets, or planets outside our solar system. With more than 5,000 exoplanets confirmed to date, the challenge now is to understand these planets in more depth. More than just knowing an exoplanet’s size or mass, cutting-edge research now focuses on learning about their atmospheres. And tools like JWST are making it possible to see into these far-off atmospheres in more detail than ever before. NASA, ESA, CSA, J. Olmsted (STScI) Composition of the atmosphere of WASP-39b JWST’s instruments are used to perform a technique called transit spectroscopy. They observe light coming from the host star as it passes through the planet’s atmosphere. This light is split into different wavelengths, and from this, researchers can see which wavelengths have been absorbed. Different chemicals absorb different wavelengths of light, allowing researchers to determine the composition of the planet’s atmosphere. The research found that there was sodium, potassium, carbon monoxide, and water vapor in the atmosphere, which confirms previous findings that WASP-39b has water vapor in its atmosphere. But it also found sulfur dioxide, the first time this molecule has been detected in an exoplanet atmosphere. Finding these molecules hints at a process similar to that found in Earth’s ozone layer, as sulfur dioxide is formed from chemical reactions in the upper atmosphere caused by light from the host star. “This is the first time we see concrete evidence of photochemistry – chemical reactions initiated by energetic stellar light – on exoplanets,” said another of the researchers, Shang-Min Tsai of the University of Oxford. “I see this as a really promising outlook for advancing our understanding of exoplanet atmospheres with [this mission].” With WASP-39 b orbiting so close to its host star, at one-eighth the distance between Mercury and the Sun, studying it can show how radiation from stars interacts with planetary atmospheres. While radiation can be harmful to life (Earth is protected from the Sun’s radiation by its magnetosphere, without which the planet could have been uninhabitable), it can also play an important role in chemical reactions creating molecules needed to sustain a habitable atmosphere. “Planets are sculpted and transformed by orbiting within the radiation bath of the host star,” Batalha said. “On Earth, those transformations allow life to thrive.”",
        "link": "https://www.theverge.com/2022/11/24/23475707/jwst-exoplanet-wasp-39b-atmosphere-details",
        "probability_title": {
            "pos": 0.8054644749119277,
            "neg": 0.19453552508807231
        },
        "probability_description": {
            "pos": 0.7930639720342826,
            "neg": 0.20693602796571742
        }
    },
    {
        "title": "How cooking food and gathering for feasts made us human",
        "image": "https://scx1.b-cdn.net/csz/news/tmb/2022/how-cooking-food-and-g.jpg",
        "video": null,
        "description": "If you're cooking a meal for Thanksgiving or just showing up to feast, you're part of a long human history—one that's older than our own species.",
        "content": null,
        "link": "https://phys.org/news/2022-11-cooking-food-feasts-human.html",
        "probability_title": {
            "pos": 0.7267642503488405,
            "neg": 0.27323574965115954
        },
        "probability_description": {
            "pos": 0.7779374511702932,
            "neg": 0.22206254882970683
        }
    },
    {
        "title": "Outages ITOps professionals are thankful to avoid",
        "image": null,
        "video": null,
        "description": "ITOps teams that automate and simplify processes can avoid costly outages — allowing them to enjoy an uninterrupted Thanksgiving.",
        "content": "ITOps teams that automate and simplify processes can avoid costly outages — allowing them to enjoy an uninterrupted Thanksgiving.Read More",
        "link": "https://venturebeat.com/data-infrastructure/outages-itops-professionals-are-thankful-to-avoid/",
        "probability_title": {
            "pos": 0.7500690318090111,
            "neg": 0.24993096819098887
        },
        "probability_description": {
            "pos": 0.858733868698556,
            "neg": 0.14126613130144405
        }
    },
    {
        "title": "\"Mrs. Maisel\" and lessons from the kids' table",
        "image": "https://media.salon.com/2022/11/marvelous_mrs_maisel_still_10.jpg",
        "video": null,
        "description": "A tribute to that holiday seating place of kids, unmarried aunts, manchildren and the recently divorced",
        "content": "-- Shares Facebook Twitter Reddit Email view in app I first watched \" The Marvelous Mrs. Maisel ,\" Prime Video's hit show about a comedian who happens to be a divorcing single mom , at an interesting point. I was going through a divorce myself, and though the story is set about 60 years before our own time, some parallels were so strong as to be alarming. Some men haven't changed much from previous generations, and neither has the way we often treat adults after divorce, especially women. We infantilize them, as though only in having a present, committed partner are we truly grown-ups. In short: I was relegated to the kids' table after my marriage ended, like divorced Midge returning to her parents' apartment for refuge . . . only to find herself in the narrow twin of her childhood bedroom, left mostly unchanged. Listen, the kids' table gets a bad rap. It's punishment, where we put not only the children but the misbehavers, the deviants. Unmarried aunts get placed at the kids' table, manchildren, sullen teens. The adult table is where the sophicated conversation is, the free-flowing alcohol, the manners and the fancy food. But the kids' table can also be where the decorations are, the coloring on paper tablecloths, the whipped cream swiped from pies , which are, of course, eaten first. The kids table can be less a castigation and more an opportunity: to solve issues on your own, away from the social obligations and droll etiquette of adults. This Thanksgiving , to have a good time, check out the card table with the mismatched chairs, the one pressed against the corner of the room — or maybe even outside it, in its own room. The kids' table is where it's at. And maybe you should be there too. Related All hail the holiday aunt: the most untraditional character in traditional Christmas films Thanksgiving is all about the food, and – if you're the one tasked with making it all or even some of it – all about the stress. How many family recipes must be prepared correctly? How many Thanksgivings start with someone, likely a mother, grandmother, or female relative , up at 4 a.m., and end with someone in the kitchen in tears? Kids just know it tastes good or it doesn't. They want more or they don't. Children's tastes vary, and anyone assuming kids all simply prefer chicken fingers and plain noodles may not have met any kids like my tween , who started ordering off the adult menu as soon as he could read. But most kids aren't burdened with the family history of food, the often-heavy expectations lacing favorite picnic potatoes, or the corn casserole a deceased relative used to make that you, the living, are trying for the first time. Kids just know it tastes good or it doesn't. They want more or they don't. A holiday meal is supposed to be about coming together, not about perfection. And kids are often able to see through to the simplicity of the holiday easier than adults. Is the pie a secret family recipe requiring a complicated homemade crust, or store-bought? The only questions those at the kids' table are going to ask is: Is it a pie? (And how quickly can you pass it.) Kevin Pollak (Moishe Maisel) and Caroline Aaron (Shirley Maisel) in \"The Marvelous Mrs. Maisel\" (Amazon Studios) A good palate doesn't negate a sweet tooth. Kids are looking for candied and candied things only. And a dessert-first mentality could serve all of us well sometimes. Holidays are supposed to be fun, after all. You're supposed to enjoy them. On Thanksgiving, if you can't get yourself a serving of sweet potatoes that is mostly marshmallows, when can you? Kids know how to eat. They know to live, and they know how to have a good time. Paper crowns? Kids will wear them. Turkeys drawn from traced fingers? Kids will make them. Ridiculous, often unfunny jokes? They will tell them. And retell them. While the adult table might get bogged down in politics, kids will go down a rabbit hole of YouTubers and knock-knock jokes bordering on the absurd. Tony Shalhoub (Abe Weissman) in \"The Marvelous Mrs. Maisel\" (K.C. Bailey/Prime Video) We continually punish adults for being single, as if only a romantic partner completes or matures a person. At the kids' table, children are usually left to their own devices, sometimes even in another room where they can't be seen or heard, away from parental control. The advantage of this is that not only do kids have to solve problems — fix conflict without adult referees, figure out which fork to use — they have to help each other, older kids cutting younger kids' meat, making sure there are enough rolls for everyone. Kids learn to help others at their tiny table, especially those too small to help themselves. That's something many adults still need to remember. Want a daily wrap-up of all the news and commentary Salon has to offer? Subscribe to our morning newsletter , Crash Course. In \" The Marvelous Mrs. Maisel ,\" Midge doesn't just fall back into her old life, her life before marriage, once that marriage ends. Her parents put her there, refusing to see their grown daughter as grown once she is without the \"protection\" of a husband. So too we continually punish adults for being single, even by choice, as if only a romantic partner completes or matures a person. As if only those having kids must be separated from them at the fancy dinner table. Why do we separate people anyway on holidays? Why not make a giant table this Thanksgiving with the kids not at the end but grouped amongst us? We can all learn a lot by sitting together, dessert first, knock-knock jokes and all. Read more about food and \"Maisel\" Why Midge and Lenny are the Carrie and Big of \"The Marvelous Mrs. Maisel\" Dino chicken nuggets: the history, the meaning, the majesty of a cultural icon Susie's struggle in \"The Marvelous Mrs. Maisel\" By Alison Stine Alison Stine is a staff writer at Salon. She is the author of the novels \" Trashlands \" and \" Road Out of Winter ,\" winner of the 2021 Philip K. Dick Award. A recipient of an Individual Artist Fellowship from the National Endowment for the Arts (NEA), she has written for The New York Times, The Guardian, and others. MORE FROM Alison Stine Related Topics ------------------------------------------ Amazon Prime Commentary Divorce Holidays Kids' Table Parenting Thanksgiving The Marvelous Mrs Maisel Tv Related Articles Advertisement: Advertisement: Trending Articles from Salon Advertisement: Advertisement:",
        "link": "https://www.salon.com/2022/11/24/mrs-maisel-and-lessons-from-the-kids-table/",
        "probability_title": {
            "pos": 0.7576323497580753,
            "neg": 0.2423676502419248
        },
        "probability_description": {
            "pos": 0.8232487276142479,
            "neg": 0.1767512723857521
        }
    },
    {
        "title": "People Are Calling An Influencer Out For An \"Out Of Touch\" TikTok Where She Said She Was Going To A Luxury Hotel Because Her Hot Water Stopped Working",
        "image": "https://img.buzzfeed.com/buzzfeed-static/static/2022-11/24/14/asset/1138ccf89162/sub-buzz-4175-1669300900-16.jpg?resize=720:1080",
        "video": null,
        "description": "“The room (a very cold one) has not been read 🙄”.View Entire Post ›",
        "content": null,
        "link": "https://www.buzzfeednews.com/article/ikrd/british-influencer-dragged-staying-at-savoy-broken-heating",
        "probability_title": {
            "pos": 0.8145363970837362,
            "neg": 0.18546360291626385
        },
        "probability_description": {
            "pos": 0.79027286560064,
            "neg": 0.20972713439935997
        }
    },
    {
        "title": "United Nation Council To Investigate Iran’s Bloody Crackdown On Peaceful Protests",
        "image": null,
        "video": null,
        "description": "The U.N. Human Rights Council voted to condemn the bloody crackdown on peaceful protests and to investigate alleged abuses, particularly those committed against women and children.",
        "content": "BERLIN (AP) — The U.N. Human Rights Council voted Thursday to condemn the bloody crackdown on peaceful protests in Iran and create an independent fact-finding mission to investigate alleged abuses, particularly those committed against women and children. A resolution put forward by Germany and Iceland was backed by 25 nations, including the United States and many European, Latin American, Asian and African nations. Six countries opposed the move — China, Pakistan, Cuba, Eritrea, Venezuela and Armenia — while 16 abstained. Advertisement The United Nations’ top human rights official had earlier appealed to Iran’s government to halt the crackdown against protesters, but Tehran’s envoy at a special Human Rights Council on the country’s “deteriorating” rights situation was defiant and unbowed, blasting the initiative as “politically motivated.” The protests were triggered by the death, more than two months ago, of 22-year-old Mahsa Amini while in the custody of the morality police for violating a strictly enforced Islamic dress code. Thursday’s session in Geneva is the latest international effort to put pressure on Iran over its crackdown, which has already drawn international sanctions and other measures. German Foreign Minister Annalena Baerbock, who was on hand, said the situation presented “a test of our courage.” Advertisement “The United Nations were founded to protect the sovereignty of every state, but a regime that uses this power to violate the rights of its own people is violating the values of our United Nations,” she said. “On many occasions, we have called upon Iran to respect these rights to stop the violent crackdown on protesters, the bloodshed, the arbitrary killing, the mass arrests, the death penalties,” Baerbock said. “The only answer we received was more violence, more death.” via Associated Press Khadijeh Karimi, deputy of Iran’s vice president for Women and Family Affairs, criticized the Western effort as part of a “politically motivated move of Germany to distort the situation of human rights in Iran.” “The Islamic Republic of Iran deeply regrets that the Human Rights Council is abused once again by some arrogant states to antagonize a sovereign U.N. member state that is fully committed to its obligation to promote and protect the human rights,” Karimi said. Advertisement She trumpeted her government’s efforts to foster the role of women in the workplace and higher education and accused Western countries of turning a blind eye to rights abuses in places like Yemen, Palestinian areas, or against indigenous peoples in Canada — which the Canadian government has acknowledged. Karimi acknowledged the “unfortunate decease” of Amini and said “necessary measures” were taken afterward, including a creation of a parliamentary investigative commission. She accused Western countries of stoking riots and violence by intervening in Iran’s internal affairs. The U.N. human rights chief, Volker Türk, expressed concerns that Iran’s government has not been listening to the world community. “The people of Iran, from all walks of life across ethnicities, across ages, are demanding change. These protests are rooted in long standing denials of freedoms, in legal and structural inequalities, in lack of access to information and Internet shutdowns,” he said. “I call on the authorities immediately to stop using violence and harassment against peaceful protesters and to release all those arrested for peacefully protesting, as well as crucially, to impose a moratorium on the death penalty,” he added. Advertisement The proposal by Germany and Iceland aimed to ratchet up scrutiny that for years as been carried out by the 47-member-state council’s “special rapporteur” on Iran, whose efforts have been shunned by the Islamic Republic’s leaders. Western diplomats say Tehran has led a quiet push in Geneva and beyond to try to avoid any further scrutiny through the new council resolution being considered on Thursday. The council will now set up a “fact-finding mission” to investigate rights violations “especially with respect to women and children” linked to the protests that erupted on Sept. 16. It also demands that Tehran cooperate with the special rapporteur, such as by granting access to areas inside Iranian territory, including places of detention. The team would be expected to report back to the council in mid-2023. Amini remains a potent symbol in protests that have posed one of the most serious challenges to the Islamic Republic since the 2009 Green Movement protests drew millions to the streets. At least 426 people have been killed and more than 17,400 people have been arrested, according to Human Rights Activists in Iran, a group monitoring the unrest. Activists said Iranian security forces on Monday used heavy gunfire against demonstrators in a western Kurdish town, killing at least five during an anti-government protest at the funeral of two people killed the day before. Advertisement Related Iran United Nations UN human rights council Iranian Forces Unleash Heavy Fire On Protesters, Activists Say Iranian Soccer Team Refuses To Sing National Anthem At World Cup Iran Reportedly Sentences Anti-Government Protester To Death Go To Homepage Before You Go Suggest a correction Popular in the Community You May Like",
        "link": "https://www.huffpost.com/entry/united-nation-human-rights-iran-probe_n_637f9b13e4b0b7f65304cf90",
        "probability_title": {
            "pos": 0.7882748528455442,
            "neg": 0.21172514715445578
        },
        "probability_description": {
            "pos": 0.915684644377498,
            "neg": 0.08431535562250203
        }
    },
    {
        "title": "Researchers suggest that wormholes may look almost identical to black holes",
        "image": "https://scx1.b-cdn.net/csz/news/tmb/2022/researchers-suggest-th-1.jpg",
        "video": null,
        "description": "A group of researchers at Sofia University has found evidence that suggests the reason that a wormhole has never been observed is that they appear almost identical to black holes.",
        "content": null,
        "link": "https://phys.org/news/2022-11-wormholes-identical-black-holes.html",
        "probability_title": {
            "pos": 0.6625478753215497,
            "neg": 0.3374521246784503
        },
        "probability_description": {
            "pos": 0.8227584354291834,
            "neg": 0.17724156457081663
        }
    },
    {
        "title": "Doggone: wet pet food 'seven times worse' for climate than dry",
        "image": "https://scx1.b-cdn.net/csz/news/tmb/2022/wet-pet-diets-have-a-f.jpg",
        "video": null,
        "description": "Feeding cats and dogs wet food has a much larger climate impact than dry food, a new study found, suggesting small changes by pet owners can massively reduce their carbon footprint.",
        "content": null,
        "link": "https://phys.org/news/2022-11-doggone-pet-food-worse-climate.html",
        "probability_title": {
            "pos": 0.7069366393309795,
            "neg": 0.29306336066902056
        },
        "probability_description": {
            "pos": 0.6877134804984724,
            "neg": 0.31228651950152764
        }
    },
    {
        "title": "Novel nanoparticles deliver innovative cancer chemoimmunotherapy",
        "image": "https://scx1.b-cdn.net/csz/news/tmb/2022/novel-nanoparticles-de.jpg",
        "video": null,
        "description": "University of Pittsburgh researchers have designed cancer-fighting nanoparticles that co-deliver a chemotherapy drug and a novel immunotherapy, according to a new Nature Nanotechnology study published today.",
        "content": null,
        "link": "https://phys.org/news/2022-11-nanoparticles-cancer-chemoimmunotherapy.html",
        "probability_title": {
            "pos": 0.6352703565498234,
            "neg": 0.3647296434501765
        },
        "probability_description": {
            "pos": 0.7015716397136194,
            "neg": 0.2984283602863807
        }
    },
    {
        "title": "A study offers new insights into the record 2021 Western North America heat wave",
        "image": "https://scx1.b-cdn.net/csz/news/tmb/2022/a-study-offers-new-ins.jpg",
        "video": null,
        "description": "The heat wave that hammered western North America in late June and early July 2021 was not just any midsummer event. Over nine days, from British Columbia through Washington and Oregon and beyond, it exceeded average regional temperatures for the period by 10 degrees C (18 F), and on single days in some locales, by an astounding 30 C, or 54 F. Among many new daily records, it set a new national benchmark for all of Canada, at 121.3 F in Lytton, British Columbia. The next day, the entire town burned down amid an uncontrollable wildfire—one of many sparked by the hot, dry weather. Across the region, at least 1,400 people died from heat-related causes.",
        "content": null,
        "link": "https://phys.org/news/2022-11-insights-western-north-america.html",
        "probability_title": {
            "pos": 0.6346258897602238,
            "neg": 0.3653741102397762
        },
        "probability_description": {
            "pos": 0.7814271963963914,
            "neg": 0.21857280360360865
        }
    },
    {
        "title": "New CRISPR-based tool inserts large DNA sequences at desired sites in cells",
        "image": "https://scx1.b-cdn.net/csz/news/tmb/2022/crispr.jpg",
        "video": null,
        "description": "Building on the CRISPR gene-editing system, MIT researchers have designed a new tool that can snip out faulty genes and replace them with new ones, in a safer and more efficient way.",
        "content": null,
        "link": "https://phys.org/news/2022-11-crispr-based-tool-inserts-large-dna.html",
        "probability_title": {
            "pos": 0.6092477517355024,
            "neg": 0.39075224826449756
        },
        "probability_description": {
            "pos": 0.7011631259813669,
            "neg": 0.2988368740186331
        }
    },
    {
        "title": "A single fiber actuator inspired by human muscles",
        "image": "https://scx1.b-cdn.net/csz/news/tmb/2022/a-single-fiber-actuato.jpg",
        "video": null,
        "description": "To effectively replicate the movements of humans and animals, robots should integrate muscle-like structures. These artificial muscles should attain an optimal performance across all relevant actuation parameters, including energy density, strain, stress, and mechanical strength.",
        "content": null,
        "link": "https://phys.org/news/2022-11-fiber-actuator-human-muscles.html",
        "probability_title": {
            "pos": 0.6563602493824506,
            "neg": 0.34363975061754937
        },
        "probability_description": {
            "pos": 0.8344223340112985,
            "neg": 0.1655776659887015
        }
    },
    {
        "title": "Holiday gift guide for the esports fan in your life",
        "image": null,
        "video": null,
        "description": "It's the holiday season again and do you need a gift for the esports fan in your life? VentureBeat has you covered with our 2022 favorites.",
        "content": "It's the holiday season again and do you need a gift for the esports fan in your life? VentureBeat has you covered with our 2022 favorites.Read More",
        "link": "https://venturebeat.com/games/holiday-gift-guide-for-esports-fans-2022-competitive/",
        "probability_title": {
            "pos": 0.7056635971103665,
            "neg": 0.2943364028896335
        },
        "probability_description": {
            "pos": 0.7496872878120051,
            "neg": 0.2503127121879949
        }
    },
    {
        "title": "What is an advanced persistent threat (APT)? Definition, list, examples and management best practices",
        "image": null,
        "video": null,
        "description": "Everything you need to know about Advanced Persistent Threats (APTs) so you can strengthen your cybersecurity.",
        "content": "Everything you need to know about Advanced Persistent Threats (APTs) so you can strengthen your cybersecurity.Read More",
        "link": "https://venturebeat.com/security/what-is-an-advanced-persistent-threat-apt-definition-list-examples-and-management-best-practices/",
        "probability_title": {
            "pos": 0.6452794934907287,
            "neg": 0.35472050650927134
        },
        "probability_description": {
            "pos": 0.7835260972159275,
            "neg": 0.21647390278407258
        }
    },
    {
        "title": "Holiday gift guide for the esports fan in your life",
        "image": null,
        "video": null,
        "description": "It's the holiday season again and do you need a gift for the esports fan in your life? VentureBeat has you covered with our 2022 favorites.",
        "content": "It's the holiday season again and do you need a gift for the esports fan in your life? VentureBeat has you covered with our 2022 favorites.Read More",
        "link": "https://venturebeat.com/games/holiday-gift-guide-for-esports-fans-2022-competitive/",
        "probability_title": {
            "pos": 0.7056635971103665,
            "neg": 0.2943364028896335
        },
        "probability_description": {
            "pos": 0.7496872878120051,
            "neg": 0.2503127121879949
        }
    },
    {
        "title": "Major British Airports Set To Phase Out Liquid Limit In Hand Luggage",
        "image": null,
        "video": null,
        "description": "New CT scanners using 3D technology are set to be installed in U.K. airports by the summer of 2024, which would allow for the rules to be relaxed.",
        "content": "Major British airports are reportedly set to phase out a rule prohibiting liquids exceeding 3.4 ounces (100 ml) in hand luggages by 2024. Passengers will also no longer be required to remove their electronic devices, including laptops, from their bags. Advertisement The Times of London was first to report the news. New CT scanners using 3D technology are set to be installed in main U.K. airports by the summer of 2024, which would allow for the rules to be relaxed. The move is set to lower waiting times at airports and also reduce the use of plastic since passengers will no longer have to separate their liquids in a quart-sized bag. In the U.S., passengers who have signed up for TSA pre-check go through an expedited screening process and do not need to remove their shoes, laptops and liquids from their bags. They are still required to abide by the limit on liquids . The U.S. Transportation Security Administration has already bought 300 CT scanners and plans to add on over 1,230 in its inventory, according to The Washington Post . But while U.S. airports are rolling out the technology, the limit around liquids will likely stay in place given the long process it would take to determine whether they contain explosives. Advertisement Currently, only certain passengers are granted an exception to bring on liquids exceeding the normal limit. These oversized liquid containers, however, have to undergo an additional check, with officers placing them in an explosive detection device. Doing this for every passenger would add to waiting times. The liquid limit rule was introduced in 2006 after authorities managed to stop a planned attack by al-Qaeda which intended to target seven planes departing from Heathrow Airport for North America with liquid explosives disguised as soft drinks. Following the revelations, airlines in the U.K. prohibited passengers from bringing nearly any hand luggage into the aircraft, excluding their passports and wallets. While the rules were later relaxed, the limit on liquid size remained. Related airport TSA 8 Little Ways To Sneak In Self-Care On A Flight 7 Ways To Make Holiday Travel Just A Tiny Bit Less Stressful This Year 16 Travel Hacks That Actually Save Money Go To Homepage Before You Go Marita Vlachou Breaking News Reporter, HuffPost Suggest a correction Popular in the Community You May Like",
        "link": "https://www.huffpost.com/entry/british-airports-liquid-limits_n_637f77fee4b06ef4a541e0cd",
        "probability_title": {
            "pos": 0.6842520025688423,
            "neg": 0.31574799743115767
        },
        "probability_description": {
            "pos": 0.8540628715571643,
            "neg": 0.14593712844283563
        }
    },
    {
        "title": "Tracing changes to the human diet during the transition from hunting to agriculture",
        "image": "https://scx1.b-cdn.net/csz/news/tmb/2022/tracing-changes-to-the.jpg",
        "video": null,
        "description": "A large team of researchers affiliated with a host of institutions across Italy has used DNA found in the dental calculus of ancient peoples to help trace changes to the human diet during the transition from hunting to agriculture in Italy over thousands of years. In their paper published in the journal Nature Communications, the group describes their study of calcified plaque found on the teeth of people living during the Copper, Neolithic and Paleolithic Ages to learn more about changes wrought by a move from hunting for food to growing it.",
        "content": null,
        "link": "https://phys.org/news/2022-11-human-diet-transition-agriculture.html",
        "probability_title": {
            "pos": 0.852169635319806,
            "neg": 0.14783036468019395
        },
        "probability_description": {
            "pos": 0.8761209487626683,
            "neg": 0.12387905123733167
        }
    },
    {
        "title": "Higher Possibility Of New Stimulus Checks Coming In",
        "image": null,
        "video": null,
        "description": "Previously there were very slim chances of getting another round of stimulus checks. Recent election results show that the Republicans took the house of representatives. Americans were confused regarding their stimulus checks. Republicans Support Stimulus Checks System The last round of stimulus checks was paid in march 2021, it was issued under the American rescue […]",
        "content": "Economy Stimulus Check Top Stories Higher Possibility Of New Stimulus Checks Coming In By Md Shahnawaz - November 24, 2022 Previously there were very slim chances of getting another round of stimulus checks. Recent election results show that the Republicans took the house of representatives. Americans were confused regarding their stimulus checks. Republicans Support Stimulus Checks System The last round of stimulus checks was paid in march 2021 , it was issued under the American rescue plan act. And after that situation started improving with the covid situation and the employment rate started increasing along with their wages. So highly unlikely to receive another round of stimulus checks. However, there is the possibility of another stimulus check might come in, instead of a direct bank deposit, that might come in another form. The house of representatives thinking of issuing child tax credits to help out millions of parents all over America. This aid would help parents and households with dependents to moderate their expenses and lessen the struggle they are doing to meet ends. This is going to be offered to those parents who already have bipartisan support. This might be the best and only chance for Americans to receive the payment. But it won’t be like the previous amount. In any way the lawmakers find it difficult to pass this bill this time, affecting inflation they won’t do it. As the republicans took control of the situation after winning the recent election, the democrats won’t be able to do anything on their own, like making a decision or passing any kind of bill. They are bound to include at least one member of the republican party, those who are in charge there. Even if they are willing to go to Joe Biden for something, one of the republican members is supposed to be there. The democrats now cannot act alone. The stimulus checks started during Former president Trump’s presidency. TAGS stimulus check Facebook Twitter Pinterest WhatsApp Linkedin ReddIt Email Telegram Previous article Susie EvansTalks About Her Break Up Next article Camila Cabello Embraces Her Silly Mispronunciation Md Shahnawaz",
        "link": "https://www.theunionjournal.com/new-stimulus-checks-coming-in/",
        "probability_title": {
            "pos": 0.5479485632274741,
            "neg": 0.45205143677252585
        },
        "probability_description": {
            "pos": 0.8349626428533324,
            "neg": 0.16503735714666756
        }
    },
    {
        "title": "\"Oegugin\" influencers are rising to stardom in Korea. But there's a dark side to pop-nationalism",
        "image": "https://media.salon.com/2022/11/woman_taking_a_selfie_at_gyeongbokgung_palace_769734123.jpg",
        "video": null,
        "description": "As K-cultures have become globally popular, Korea is an attractive destination for aspiring influencers",
        "content": "-- Shares Facebook Twitter Reddit Email view in app This article was originally published on The Conversation . If you've been scrolling through YouTube, TikTok or Instagram it would be no surprise to chance upon calming minimalist aesthetics of Korean cafe decor; pilgrimages to the locations of popular K-dramas; and even the polite decorum of Korean public transport commuters. In South Korea, oegugin (foreign-national) influencers often produce social media content focused on the global interest in K-pop, K-drama and K-film for audiences inside and out of Korea. These influencers are most prominent on YouTube , where the most popular trends include binge-eating mukbang , lifestyle vlogging of fancy cafe cultures and K-pop fandom homages like visits to pop-up stores by idol groups. On platforms like TikTok and Instagram, content is shared with hashtags like #외국인 (# oegugin ) and #외국인반응 ( #oegugin-baneung , or foreigner reaction). Many oegugin influencers have risen to stardom. The duo Korean Englishman have over five million subscribers, and now regularly appear on Korean television talk shows and variety shows. In our new research , we found oegugin influencers are predominantly white-presenting non-Koreans who often adopt nationalist tones to endorse the \"excellence\" of Korean culture. The discourse is often celebratory, leverages on exoticism and promotes \"pop nationalism\": a new form of soft power marketed in the form of pop culture. Government incubation The oegugin influencer ecology is on the rise. As K-cultures have become globally popular, Korea is an attractive destination for aspiring influencers. Our study found most of these expats and migrants were English teachers, students or gig economy workers who work multiple day jobs to sustain their influencer aspirations. Many South Korean government bodies have launched projects to incubate and groom aspiring oegugin influencers, specifically to promote tourism and enhance cultural knowledge about the country. A prime example is the K-influencer Academy , sponsored by the Ministry of Culture, Sports and Tourism. Designed to cultivate \"K-influencers\" from all around the world, the academy is a YouTube training program for \"Korea lovers,\" offering free lectures on content creation and mentorship opportunities with established YouTubers. Once these influencers have been developed, the Korean government can also outsource its nation branding campaign. Capitalising upon the free labour of K-influencers, the government reposts and shares their content on official YouTube channels . A certain type of ambassador South Korea is branded as a \"new cool\" by the international media, as seen in the global popularity of K-pop. Oegugin influencers take this digital Korean cool and reproduce it on YouTube. These influencers are important conduits of inter-cultural knowledge. They act as both \"nodes\" where interested audiences cluster, and \"mediators\" of the values and norms propagated through digital Korean content. Projects like the K-influencer Academy can enhance intercultural knowledge between different cultures and countries, emphasising racial and cultural diversity. However, many campaigns and projects led by small government bodies are also heavily reliant on racial norms and stereotypes. In our research, we found the videos shared on these platforms are frequently only of white-passing oegugin . In fact, there is even a subgenre of oegugin reaction videos catering to domestic audiences' preferences for white beauty. The dark underbelly It is not all K-pop and cafe culture. Public interest in oegugin influencers can place them in the vulnerable position of receiving hateful commentary. People we spoke to reported a strong tendency to self-censor and self-regulate. Influencers who are overtly celebratory about Korea saw growth in viewership and positive audience feedback, leading to further paid opportunities with government bodies. However, when oegugin influencers share criticism about Korea they are perceived to be \"threatening\" the pop nationalist brand of the country. These influencers quickly receive online hate and trolling for sharing their thoughts. This online hate is exacerbated if the influencers are people of color, as the vitriol expands to racist and xenophobic trolling. While government partnerships are prestigious and sought-after, the reality of the working conditions leave oegugin influencers with little agency and creative control. Their work is under-compensated by government bodies, or may be used by government-related parties without permission. A careful balance Within this ecology, only a select few oegugin influencers successfully navigate away from the pop nationalist script to showcase their own interests. The most savvy might go on to cultivate their own storytelling niche. The YouTube duo Dan and Joel are originally from the UK and known for their documentary style mukbang . While they mostly feature other oegugins in their collaborative videos, their popular videos shed light on social minorities in Korea. Viral videos from the pair have seen the influencers showcasing a feminist tattooist and older homeless people, stimulating conversations on feminism or shedding light on poverty. In this, they give viewers a glimpse into the less polished aspects of \"real\" Korea . In the predominantly white ecology, such a distinctive strategy is not a privilege accorded to all influencers. To maintain viewer traffic (which they aspire to translate into revenue) we found many influencers still abide by the convenient racial stereotypes which play up white exotica and privilege. Although more oegugins are entering the industry and contributing to its diverse ecology, in reality, the oegugin influencer economy is still dominated by only a select crop who adhere to Korea's normative racial hierarchy. Jin Lee , Research Fellow, Curtin University and Crystal Abidin , Associate Professor & ARC DECRA Fellow, Internet Studies, Curtin University This article is republished from The Conversation under a Creative Commons license. By Jin Lee MORE FROM Jin Lee By Crystal Abidin MORE FROM Crystal Abidin Related Topics ------------------------------------------ Commentary Hallyu Influencers K-dramas K-influencer Academy K-pop Korea Nationalism Race Social Media South Korea The Conversation Related Articles Advertisement: Advertisement: Trending Articles from Salon Advertisement: Advertisement:",
        "link": "https://www.salon.com/2022/11/24/oegugin-influencers-are-rising-to-stardom-in-korea-but-theres-a-dark-side-to-pop-nationalism_partner/",
        "probability_title": {
            "pos": 0.7247990145903893,
            "neg": 0.27520098540961074
        },
        "probability_description": {
            "pos": 0.7949764023710701,
            "neg": 0.20502359762892985
        }
    },
    {
        "title": "\"Oegugin\" influencers are rising to stardom in Korea. But there's a dark side to pop-nationalism",
        "image": "https://media.salon.com/2022/11/woman_taking_a_selfie_at_gyeongbokgung_palace_769734123.jpg",
        "video": null,
        "description": "As K-cultures have become globally popular, Korea is an attractive destination for aspiring influencers",
        "content": "-- Shares Facebook Twitter Reddit Email view in app This article was originally published on The Conversation . If you've been scrolling through YouTube, TikTok or Instagram it would be no surprise to chance upon calming minimalist aesthetics of Korean cafe decor; pilgrimages to the locations of popular K-dramas; and even the polite decorum of Korean public transport commuters. In South Korea, oegugin (foreign-national) influencers often produce social media content focused on the global interest in K-pop, K-drama and K-film for audiences inside and out of Korea. These influencers are most prominent on YouTube , where the most popular trends include binge-eating mukbang , lifestyle vlogging of fancy cafe cultures and K-pop fandom homages like visits to pop-up stores by idol groups. On platforms like TikTok and Instagram, content is shared with hashtags like #외국인 (# oegugin ) and #외국인반응 ( #oegugin-baneung , or foreigner reaction). Many oegugin influencers have risen to stardom. The duo Korean Englishman have over five million subscribers, and now regularly appear on Korean television talk shows and variety shows. In our new research , we found oegugin influencers are predominantly white-presenting non-Koreans who often adopt nationalist tones to endorse the \"excellence\" of Korean culture. The discourse is often celebratory, leverages on exoticism and promotes \"pop nationalism\": a new form of soft power marketed in the form of pop culture. Government incubation The oegugin influencer ecology is on the rise. As K-cultures have become globally popular, Korea is an attractive destination for aspiring influencers. Our study found most of these expats and migrants were English teachers, students or gig economy workers who work multiple day jobs to sustain their influencer aspirations. Many South Korean government bodies have launched projects to incubate and groom aspiring oegugin influencers, specifically to promote tourism and enhance cultural knowledge about the country. A prime example is the K-influencer Academy , sponsored by the Ministry of Culture, Sports and Tourism. Designed to cultivate \"K-influencers\" from all around the world, the academy is a YouTube training program for \"Korea lovers,\" offering free lectures on content creation and mentorship opportunities with established YouTubers. Once these influencers have been developed, the Korean government can also outsource its nation branding campaign. Capitalising upon the free labour of K-influencers, the government reposts and shares their content on official YouTube channels . A certain type of ambassador South Korea is branded as a \"new cool\" by the international media, as seen in the global popularity of K-pop. Oegugin influencers take this digital Korean cool and reproduce it on YouTube. These influencers are important conduits of inter-cultural knowledge. They act as both \"nodes\" where interested audiences cluster, and \"mediators\" of the values and norms propagated through digital Korean content. Projects like the K-influencer Academy can enhance intercultural knowledge between different cultures and countries, emphasising racial and cultural diversity. However, many campaigns and projects led by small government bodies are also heavily reliant on racial norms and stereotypes. In our research, we found the videos shared on these platforms are frequently only of white-passing oegugin . In fact, there is even a subgenre of oegugin reaction videos catering to domestic audiences' preferences for white beauty. The dark underbelly It is not all K-pop and cafe culture. Public interest in oegugin influencers can place them in the vulnerable position of receiving hateful commentary. People we spoke to reported a strong tendency to self-censor and self-regulate. Influencers who are overtly celebratory about Korea saw growth in viewership and positive audience feedback, leading to further paid opportunities with government bodies. However, when oegugin influencers share criticism about Korea they are perceived to be \"threatening\" the pop nationalist brand of the country. These influencers quickly receive online hate and trolling for sharing their thoughts. This online hate is exacerbated if the influencers are people of color, as the vitriol expands to racist and xenophobic trolling. While government partnerships are prestigious and sought-after, the reality of the working conditions leave oegugin influencers with little agency and creative control. Their work is under-compensated by government bodies, or may be used by government-related parties without permission. A careful balance Within this ecology, only a select few oegugin influencers successfully navigate away from the pop nationalist script to showcase their own interests. The most savvy might go on to cultivate their own storytelling niche. The YouTube duo Dan and Joel are originally from the UK and known for their documentary style mukbang . While they mostly feature other oegugins in their collaborative videos, their popular videos shed light on social minorities in Korea. Viral videos from the pair have seen the influencers showcasing a feminist tattooist and older homeless people, stimulating conversations on feminism or shedding light on poverty. In this, they give viewers a glimpse into the less polished aspects of \"real\" Korea . In the predominantly white ecology, such a distinctive strategy is not a privilege accorded to all influencers. To maintain viewer traffic (which they aspire to translate into revenue) we found many influencers still abide by the convenient racial stereotypes which play up white exotica and privilege. Although more oegugins are entering the industry and contributing to its diverse ecology, in reality, the oegugin influencer economy is still dominated by only a select crop who adhere to Korea's normative racial hierarchy. Jin Lee , Research Fellow, Curtin University and Crystal Abidin , Associate Professor & ARC DECRA Fellow, Internet Studies, Curtin University This article is republished from The Conversation under a Creative Commons license. By Jin Lee MORE FROM Jin Lee By Crystal Abidin MORE FROM Crystal Abidin Related Topics ------------------------------------------ Commentary Hallyu Influencers K-dramas K-influencer Academy K-pop Korea Nationalism Race Social Media South Korea The Conversation Related Articles Advertisement: Advertisement: Trending Articles from Salon Advertisement: Advertisement:",
        "link": "https://www.salon.com/2022/11/24/oegugin-influencers-are-rising-to-stardom-in-korea-but-theres-a-dark-side-to-pop-nationalism_partner/",
        "probability_title": {
            "pos": 0.7247990145903893,
            "neg": 0.27520098540961074
        },
        "probability_description": {
            "pos": 0.7949764023710701,
            "neg": 0.20502359762892985
        }
    },
    {
        "title": "New data on 'hot Saturn' exoplanet is a 'game changer,' scientists say - CNN",
        "image": null,
        "video": null,
        "description": "New data on 'hot Saturn' exoplanet is a 'game changer,' scientists say  CNNLight from Distant Worlds: Exoplanet atmospheres revealed by JWST | University of Bristol  University of BristolAs Never Seen Before: NASA’s Webb Reveals an Exoplanet Unlike Any in Our Solar System  SciTechDailyWebb reveals an exoplanet atmosphere as never seen before  European Space AgencyJames Webb Space Telescope uncovers origins of distant planet  BBCView Full Coverage on Google News",
        "content": null,
        "link": "https://news.google.com/__i/rss/rd/articles/CBMiYGh0dHBzOi8vd3d3LmNubi5jb20vMjAyMi8xMS8yNC93b3JsZC93YXNwLTM5Yi1ib2NhcHJpbnMtd2ViYi1hdG1vc3BoZXJlLWRpc2NvdmVyeS1zY24vaW5kZXguaHRtbNIBZGh0dHBzOi8vYW1wLmNubi5jb20vY25uLzIwMjIvMTEvMjQvd29ybGQvd2FzcC0zOWItYm9jYXByaW5zLXdlYmItYXRtb3NwaGVyZS1kaXNjb3Zlcnktc2NuL2luZGV4Lmh0bWw?oc=5",
        "probability_title": {
            "pos": 0.5770817969032471,
            "neg": 0.4229182030967528
        },
        "probability_description": {
            "pos": 0.7642405113117355,
            "neg": 0.23575948868826446
        }
    },
    {
        "title": "Your Stimulus Check Will Arrive Before 2023 Especially If You Live In Different States",
        "image": null,
        "video": null,
        "description": "Consumers in the US are struggling as a result of the present inflationary situation. Prices have soared, particularly for basics. States made the decision to assist and provide stimulus check payments to their citizens in response to this scenario of growing expense of living. As a result, they will get access to the cash before the […]",
        "content": "Economy Stimulus Check Top Stories Your Stimulus Check Will Arrive Before 2023 Especially If You Live In Different States By Md Shahnawaz - November 24, 2022 Stimulus check Consumers in the US are struggling as a result of the present inflationary situation. Prices have soared, particularly for basics. States made the decision to assist and provide stimulus check payments to their citizens in response to this scenario of growing expense of living. As a result, they will get access to the cash before the year is through. The following ten states will pay during the next weeks. States That Will Send The Stimulus Check Before This Year Ends: People in California started getting payments in October of last year, and the help will now endure through January 2023. Many residents—thousands of them—will receive their tax refunds. There are two options for this, one involving bank transfer while the other using the supply of debit. ten-fifty dollars is the highest amount that may be made. The strategies of all the states are not equal, as we have discussed, thus not everyone benefits equally. So, what is the stimulus check amount? And when will each case’s reward check arrive? Here are the eligibility criteria for some states: The money is anticipated to be given before the end of the current calendar year and the collecting limitation in North Carolina is seven-hundred dollars. Based on the kind of return—individual or joint—Colorado taxpayers will get a payout from seven-fifty dollars and fifteen hundred dollars. In the meantime, Delaware pays people who have submitted their taxes for the last two years a one-time payout stimulus check of three hundred dollars. One of the most common inquiries posed by citizens of the southern state is the following. The amount allotted to households with kids in four-fifty dollars. Recipients will not need to take any action in order for stimulus check payments to be issued. TAGS stimulus check Facebook Twitter Pinterest WhatsApp Linkedin ReddIt Email Telegram Previous article Hot Stock on Radar: Microsoft Corporation (MSFT) Next article Canada Puts Up A Brave Fight: Yet Lost To Belgium In Their First WC Appearance In More Than Three Decades Md Shahnawaz",
        "link": "https://www.theunionjournal.com/your-stimulus-check-will-arrive-prior-2023/",
        "probability_title": {
            "pos": 0.7233808315872288,
            "neg": 0.27661916841277123
        },
        "probability_description": {
            "pos": 0.7852349446926464,
            "neg": 0.21476505530735357
        }
    },
    {
        "title": "Report: 1 in 5 CISOs work more than 25 extra hours per week",
        "image": null,
        "video": null,
        "description": "A new report found that about 20% of CISOs work more than 25 extra hours per week.",
        "content": "A new report found that about 20% of CISOs work more than 25 extra hours per week.Read More",
        "link": "https://venturebeat.com/security/report-1-in-5-cisos-work-more-than-25-extra-hours-per-week/",
        "probability_title": {
            "pos": 0.7142530891120021,
            "neg": 0.28574691088799786
        },
        "probability_description": {
            "pos": 0.7726098790974453,
            "neg": 0.22739012090255473
        }
    },
    {
        "title": "Wildlife summit to vote on shark protections",
        "image": "https://scx1.b-cdn.net/csz/news/tmb/2022/the-proposal-would-pla.jpg",
        "video": null,
        "description": "Delegates at a global summit on trade in endangered species will decide Thursday whether to approve a proposal to protect sharks, a move that could drastically reduce the lucrative and often cruel shark fin trade.",
        "content": null,
        "link": "https://phys.org/news/2022-11-wildlife-summit-vote-historic-shark.html",
        "probability_title": {
            "pos": 0.7061093727676342,
            "neg": 0.2938906272323658
        },
        "probability_description": {
            "pos": 0.7127287004829509,
            "neg": 0.2872712995170491
        }
    },
    {
        "title": "The very human, very troubling stories we tell ourselves about crime",
        "image": null,
        "video": null,
        "description": null,
        "content": "In 2005, the year I moved to New York City, the NYPD recorded 135,475 crimes in the seven “major felony” categories — homicides, assaults, rapes, and various forms of theft. The next year, that number dropped, and it kept dropping. By 2017, it was around 96,000, where it stayed until last year, when it snuck back over 100,000, mostly due to an increase in grand larcenies, auto and otherwise. The “non-major” felony data has followed a similar arc, dropping almost 30 percent since 2005 . By the official crime numbers, the most dangerous year that I’ve lived in New York City was the first one — by a lot. So why do people keep asking me if I’m safe here? Last week, I found myself assuring a kind older gentleman in town from Boston — where violent crime has been creeping up after pandemic lows — that he was almost certainly perfectly fine walking around the swanky restaurant-laden blocks near Times Square. Statistically, the Big Apple is safer than small-town America , and its per-capita murder rate was at the bottom of the list of big cities in early 2022. I’ve been intrigued and baffled hearing from people from my hometown ( which leads upstate New York in crime statistics ) who might have taken a day trip down to the city to see the Christmas decorations and eat some roasted chestnuts, but won’t travel here anymore because they think it’s a war zone. Emotional stories speak louder than facts, perhaps especially in a city as storied as New York. Writing of the city’s crime narratives during a much more dangerous era, Joan Didion wrote of observers’ “preference for broad strokes, for the distortion and flattening of character and the reduction of events to narrative” — in other words, the nearly universal desire to make stories out of feelings, and then believe them. And when people ask me if “New York is safe,” they don’t want to know about numbers. They’re asking about feelings . Mayor Eric Adams speaks about public safety. Getty Images How people perceive crime, and how politicians represent it to the electorate, has less to do with data and more to do with vibes. In October, while fact-checking the claims of rising violent crime that drove many midterm campaigns, the Pew Research Center’s John Gramlich noted that “the public often tends to believe that crime is up, even when the data shows it is down.” Data from the DOJ’s Bureau of Justice Statistics shows that there’s no increase in violent crime across the board in the US, and yet for most years in the last three decades, the majority of America adults thought there was more crime nationally than the year before, even though the opposite was true. Indeed, over three-quarters of those polled in October by Politico/Morning Consult said they thought violent crime was rising nationally and 88 percent said it was increasing or remaining the same in their own communities. It’s not just ordinary citizens whose perceptions about crime in specific places can be markedly divorced from reality. In 1990, there were 2,262 murders in New York, and Mayor Eric Adams was a transit officer. But in May 2022, he claimed he’d “never witnessed crime at this level,” even though the murder total in 2021 was 488, a little less than a fifth of the 1990 level. ( Per the NYPD’s own data , the rate of crime is more than 80 percent lower than in 1990.) Adams has alternated between saying he’s afraid to take the subway and taking credit for the city’s continued drops in violent crime. It’s hard to know what to believe, maybe even for Adams. News coverage, which seizes on the stories that seem most emblematic of the problems the viewers and readers fear, has a profound effect on how people perceive criminal justice and their own safety. Furthermore, popular entertainment has seized upon crime as the most hardy and enduring way to draw in an audience, whether it’s the endless true crime documentary machine, the Lifetime movie engine, or the Law & Order empire . A steady diet of crime content magnifies our sense that crime happens at random all the time and that we’re the next target. So even if the facts tell us that New York City, or maybe our hometown, is a safe place to live, that we’re highly unlikely to be the victim of a crime, and that within most of our lifetimes there’s been a marked change for the better, we still find ourselves living another story. The five young Harlem men wrongfully convicted of raping a jogger in 1989 in Central Park were eventually exonerated, but not until after years in prison. Graham Morrison/Getty Images And that’s a dangerous place to be, something Didion detected so clearly in the city’s storytelling. “The imposition of a sentimental, or false, narrative on the disparate and often random experience that constitutes the life of a city or a country means, necessarily, that much of what happens in that city or country will be rendered merely illustrative, a series of set pieces, or performance opportunities,” she wrote in 1991, at a time when crime was truly, statistically skyrocketing. In her essay “Sentimental Journeys,” about the 1989 assault of a jogger in Central Park that led to the wrongful conviction of five teenagers from Harlem, she explored how that particular crime became a symbol of everything that was wrong with New York and, by extension, the country at large. Women had been assaulted and murdered in other contexts throughout the city, but the Central Park jogger case caught the imagination of the world primed to see it as illustrative of whatever they believed was wrong with humanity. And so, while an actual woman was harmed, and five young men had decades of their lives taken from them by the state, politicians found a place to land their lofty rhetoric. Didion notes that “Governor [Mario] Cuomo could ‘declare war on crime’ by calling for five thousand additional police; Mayor Dinkins could ‘up the ante’ by calling for sixty-five hundred.” As if they’re crusaders in Gotham working with Batman to rid the town of crime, not public servants making decisions based on careful analysis. All these years later, history repeated: New York Gov. Kathy Hochul announced in September that cameras would be installed on 2,700 subway cars to “focus on getting that sense of security back” — a telling focus on feelings. At the same press conference, Adams said that “if New Yorkers don’t feel safe, we are failing.” Recently, subway conductors have begun announcing at nearly every stop that NYPD officers are on the platform “in case you are in need of assistance,” apparently as part of the police surge announced by Adams and Hochul. Even if you buy that there’s a causal link between police presence and safety for subway riders, the new surge is cold comfort to those who actually ride the subways every day. An already beefed-up NYPD presence in and around subways has been obvious for well over a year; they were the only group of people who seemed to be able to walk around the transit system unmasked without fear of being fined. Cross through the busy Atlantic Avenue station in Brooklyn at 11 pm on a Thursday, and you’ll see clumps of three or four cops everywhere, chatting with one another as the traffic flows around them. At the same time, there’s been a rise in killing in and around the subway (nine this year, rather than the pre-pandemic average of two per year; last Monday 3.5 million rode the subway in one day ). When, in January, 44-year-old Michelle Go was pushed onto the tracks by a mentally ill man and killed, there were six cops in the station, and two nearby. A beefed-up police presence has been obvious in New York for a year. Getty Images And when there was an actual shooting in the subway last spring (thankfully resulting in no fatalities), the suspect remained at large for a day, with police unable to find him even though he left a credit card at the scene of the crime. Adams said one of the cameras in the station wasn’t functioning, as well as cameras in the stations before and after. The suspect was finally apprehended — by a civilian. The point of all of this is that the narrative seems wrong, and that means the conclusion is off. The narrative goes like this: Crime is happening, and it feels like it’s happening more now than ever because people keep saying it is — even the mayor! Police deal with crime, and thus, we need more police, and they will stop the crime from happening. It is sentimental because it taps into feelings we have, and those feelings just seem like they’re true. But there are basic contradictions in the story. So continuing to tell it becomes a way of comforting ourselves, and also of increasing police budgets. Yet the story doesn’t answer basic questions we ought to be asking : Why did that crime happen in the first place? What root problems does it illuminate, and how can those be solved? If the issue is, as Adams says, that there are many mentally ill people in the subways who commit crimes, are they New Yorkers who deserve a sense of protection and safety too? Does history show that increased police presence aids these people? Or does “New Yorker” only refer to people like me? The sentimental narrative simplifies the reality of the “disparate and often random experiences” of life and provides “performance opportunities.” The situation “offered a narrative for the city’s distress, a frame in which actual social and economic forces wrenching the city could be personalized and ultimately obscured,” wrote Didion. Cases like that of the Central Park jogger were a way for the city to deal with its general anxiety about the widening economic and social gap, something that had become stark during the 1980s, with the same solutions being suggested: Here was a case that gave this middle class a way to transfer and express what had clearly become a growing and previously inadmissible rage with the city’s disorder, with the entire range of ills and uneasy guilts that came to mind in a city where entire families slept in the discarded boxes in which new Sub-Zero refrigerators were delivered, at twenty-six hundred per, to more affluent families … If the city’s problems could be seen as deliberate disruptions of a naturally cohesive and harmonious community, a community in which, undisrupted, “contrasts” generated a perhaps dangerous but vital “energy,” then those problems were tractable, and could be addressed, like “crime,” by the call for “better leadership.” That’s what I think about now when I listen to people tell me how dangerous New York is, or listen to the mayor give solutions — well, the same solution, over and over. The facts, and the problems, don’t match the “solutions”; they’re the conclusion to a story that lies on top of reality. It’s not that there’s nothing to worry about. It’s that, on the whole, we rush to the fix that assuages our fears, rather than hunting around for new ones. Or we change behaviors in order to protect ourselves from things that pose a very small threat, which gives us the emotional permission to ignore the much larger one we pose ourselves. Help keep articles like this free Understanding America’s political sphere can be overwhelming. That’s where Vox comes in. We aim to give research-driven, smart, and accessible information to everyone who wants it. Reader gifts support this mission by helping to keep our work free — whether we’re adding nuanced context to unexpected events or explaining how our democracy got to this point. While we’re committed to keeping Vox free, our distinctive brand of explanatory journalism does take a lot of resources. Advertising alone isn’t enough to support it. Help keep work like this free for all by making a gift to Vox today. One-Time Monthly Annual $95 /year $120 /year $250 /year Other $ Yes, I'll give $120 /year Yes, I'll give $120 /year We accept credit card, Apple Pay, and Google Pay. You can also contribute via",
        "link": "https://www.vox.com/culture/23473173/crime-new-york-joan-didion",
        "probability_title": {
            "pos": 0.7661951729321848,
            "neg": 0.23380482706781525
        },
        "probability_description": {
            "pos": 0.8390364261733789,
            "neg": 0.16096357382662113
        }
    },
    {
        "title": "Ukraine Works To Restore Power After Bruising Russian Attack",
        "image": null,
        "video": null,
        "description": "Kyiv's mayor says that 70% of the Ukrainian capital has been left without power a day after Moscow unleashed another missile barrage on Ukraine’s infrastructure.",
        "content": "KYIV, Ukraine (AP) — About 70% of the Ukrainian capital was left without power, Kyiv’s mayor said Thursday, a day after Moscow unleashed yet another devastating missile and drone barrage on Ukraine’s energy infrastructure. Wednesday’s renewed Russian attack on Ukrainian infrastructure caused power outages across large parts of the country, further hobbling Ukraine’s already battered power network and adding to the misery for civilians as temperatures plunge. The strikes also caused power outages in neighboring Moldova. Advertisement Russia has been targeting Ukraine’s power infrastructure following a string of battlefield setbacks its forces suffered during the full scale war it launched Feb. 24, exactly nine months ago Thursday. Kyiv Mayor Vitali Klitschko said in a Telegram statement that “power engineers are doing their best to get (electricity) back as soon as possible” and added that the water supply has been restored in about half of Kyiv on the left bank of the Dnieper River. Ukraine’s General Staff reported on Thursday morning that Russian forces fired 67 cruise missiles and 10 drones during Wednesday’s “massive attack on residential buildings and energy infrastructure” in Kyiv and several other regions in Ukraine. Efforts to restore power, heating and water supplies disrupted by the Wednesday attacks were underway elsewhere in Ukraine as well. Advertisement Ukrainian State Emergency Service firefighters work to extinguish a fire at the scene of a Russian shelling in the town of Vyshgorod outside the capital Kyiv, Ukraine, on Nov. 23, 2022. AP Photo/Efrem Lukatsky Ukraine’s energy minister Herman Haluschenko said three out of four nuclear power stations that are fully functioning and which had been forced offline by Wednesday’s strikes were subsequently reconnected to the grid. Governor of the Poltava region Dmytro Lunin said “an optimistic scenario” suggested that electricity will come back to residents of his central Ukrainian region on Thursday. “In the next few hours, we will start supplying energy to critical infrastructure, and then to the majority of household consumers,” Lunin said on Telegram, noting that power has already been restored for 15,500 people and 1,500 legal entities in the region. Lunin added that water supplies resumed in several parts of the city of Poltava, and four boiler stations have started to heat regional hospitals. Advertisement The Kirovohrad and the Vinnytsia regions were reconnected to the power grid early Thursday, adding to more than a dozen other regions that were reconnected on Wednesday night, according to Deputy head of Ukraine’s presidential office Kyrylo Tymoshenko. In the southeastern Dnipropetrovsk region, power has been restored for up to 50% of consumers, Gov. Valentyn Reznichenko said, but noted that “the situation with energy is complicated.” A view of Podil district during a blackout after a Russian rocket attack in Kyiv, Ukraine, on Nov. 23, 2022. Russia unleashed a new missile onslaught on Ukraine's battered energy grid Wednesday, robbing cities of power and some of water and public transport, too, compounding the hardship of winter for millions. The aerial mauling of power supplies also took nuclear plants and internet links offline and spilled blackouts into neighbor Moldova. AP Photo/Andrew Kravchenko As Russia continues to assail Ukraine’s power network, Ukrainian authorities started opening what they call “points of invincibility” — heated and powered spaces where people could go for hot meals, electricity to recharge their devices and to connect to the internet. Kyrylo Tymoshenko, deputy head of Ukraine’s presidential office, said on Thursday morning that a total of 3,720 such spaces have been opened across the country. Advertisement According to the initiative’s website, various venues have been converted to such points including government buildings, schools and kindergartens and emergency services offices. ___ Follow AP coverage of the war in Ukraine at: https://apnews.com/hub/russia-ukraine Related Russia Ukraine Multiple Explosions Heard Across Ukrainian Capital Kyiv Banksy Releases Video In Ukraine With A Heartbreaking Mother-Daughter Moment Mike Pompeo Names 'The Most Dangerous Person In The World' And It's A Surprise Go To Homepage Before You Go Suggest a correction Popular in the Community You May Like",
        "link": "https://www.huffpost.com/entry/russia-ukraine-war_n_637f51cae4b09a86b1b06e1c",
        "probability_title": {
            "pos": 0.8038757319256553,
            "neg": 0.1961242680743447
        },
        "probability_description": {
            "pos": 0.8764075507255895,
            "neg": 0.12359244927441049
        }
    },
    {
        "title": "‘Fyre Festival 2.0’: Fans Slam Makeshift Shelters, Metal Box Rooms At Qatar World Cup",
        "image": null,
        "video": null,
        "description": "“I’m here because I couldn’t find anywhere else,” said one fan paying $450 a night in a sparse tent village promoted as perfect for a “lavish stay.\"",
        "content": "AL KHOR, Qatar (AP) — For scores of foreign soccer fans, the road to the World Cup in Doha starts every morning at a barren campsite in the middle of the desert. Visitors who found hotels in central Doha booked up or far beyond their budget have settled for the faraway, dust-blown tent village in Al Khor, where there are no locks on tents nor beers on draft. Advertisement Others simply wanted an adventure. On Wednesday a DJ blasted electronic dance music around a fire pit as a smattering of fans lounged on beanbags, sipped sodas and gazed up at big screens roughly an hour from Doha. “I’m here because I couldn’t find anywhere else,” said Haidar Haji, a 27-year-old architectural engineer from Kuwait. He said it was a pain to trek into Doha every morning from the tent village, but he had no other option. “The hotels were just too expensive. It was crazy.” Visitors who found hotels in central Doha booked up or far beyond their budget have settled for the faraway, dust-blown tent village in Al Khor, where there are no locks on tents nor beers on draft.. via Associated Press Even so, Al Khor fan village is not cheap. Haji said he’s paying $450 a night for his sparse makeshift shelter, which authorities advertise as a “perfect destination for a truly enjoyable and lavish stay.” The tents are equipped with plumbing and basic furniture. The site has a swimming pool and upscale Arabic restaurant. Advertisement From the moment that Qatar was named host of the World Cup, fears mounted over how the tiny country would find rooms for the massive influx of 1.2 million fans — equal to almost one-third of the population. Qatar’s frenzied building program delivered tens of thousands of rooms through new hotels, rented apartments and even three giant cruise ships. But soaring prices have forced many thrifty fans into remote desert campsites and giant fan villages in Doha’s outer reaches, including one near the airport consisting of corrugated box rooms. At Al Khor Village, many fans complained about the isolation, and lack of alcohol. “Honestly, you can find more alcohol in Tehran,” said Parisa, a 42-year-old Iranian oil worker who declined to give her last name, citing the political situation in Iran. She was gazing into space in the campsite common area, and said she had little idea how to fill her time. Doha’s swanky hotel bars were miles away. “We thought they would open up more for the foreigners to have fun.” Paola Bernal from Tabasco, southern Mexico, wasn’t sure what to expect from the first World Cup in the Middle East. But she said she’s been surprised by how long it takes to traverse the world’s tiniest host country. The buses from the campsite are a “mess,” she said, and stop running at 10 p.m., forcing fans to fork out large sums for Uber rides. “There are such long distances, I don’t know how,” she said. Although some stadiums are linked to Doha’s gleaming new metro network, they often require a 2.5 kilometer (1.5 mile) walk from the stations. Other grounds can only be reached by bus, with some drop-off points a trek from stadium gates — and desirable bars and restaurants even further afield. Advertisement Al Khor’s arid grounds are no selfie-taker’s paradise. But Nathan Thomas, a site designer, said he was very pleased with the “authentic Arabian” result. The only major worry, he said, is security. Not every tent is in eyeshot of a guard post. Tents have no locks. Their flaps easily untie. “We keep telling people it’s a safe country, don’t worry,” he said. From the Free Zone Fan Village, in the desert south of Doha, fans were lugging suitcases across large swaths of artificial turf under the glare of stadium lights. The manufactured cabins are some of the cheapest available accommodation, starting at roughly $200 a night. Every few minutes, low-flying planes roar over the village to the old airport, which has been reopened to handle daily shuttle flights to the tournament. Banners plastered on the trailers urge fans to “Cheer up.” Just days before the tournament, social media filled with images of toilets that had yet to be installed and wires still coiled on the dirt to hook up water and electricity. Many complained of excessively long waits to check in. A crowd of guests waiting in line Wednesday night said they couldn’t get their rooms because the reception desk wasn’t sure who had already checked out. “We wanted good vibes, good energy, to be with other people,” said Mouman Alani from Morocco. “This is very disorganized.” Advertisement One camper on Twitter lambasted the site as “Fyre Festival 2.0,” referring to an infamous music festival billed as a luxury getaway that left fans scrambling for makeshift shelters on a dark beach. “When we went to our room, it was all messed up,” said Aman Mohammed, a 23-year-old from Kolkata, India, at the common area on Wednesday. He said he waited two hours under the searing sun for a cleaner to arrive the day before. “It was stinking so bad, like a bad bathroom. It was pathetic.” But, he insisted, there was no false advertising. The website shows scores of colorful metal boxes side by side in a vast dusty lot. And despite his disappointment, he said, the World Cup was ultimately about the soccer. “(Cristiano) Ronaldo is playing his last World Cup, I’m here just to see him,” Mohammed said, referring to the superstar competing for Portugal in the tournament. “To attend this is a dream for me since I was a child.” Associated Press reporter Jon Gambrell in Doha contributed to this report. Related qatar FIFA World Cup England Wary Of Soccer World Cup Upset Against U.S. Japan Hailed As 'Winners On And Off Pitch' After Admirable Move From World Cup Fans Germany World Cup Players Rip FIFA With Single Gesture Before Their Match Go To Homepage Before You Go Suggest a correction Popular in the Community You May Like",
        "link": "https://www.huffpost.com/entry/qatar-world-cup-accomodation_n_637f4e3fe4b006c42d3bac4c",
        "probability_title": {
            "pos": 0.7578003263770616,
            "neg": 0.24219967362293843
        },
        "probability_description": {
            "pos": 0.9126118847428213,
            "neg": 0.08738811525717866
        }
    },
    {
        "title": "Treating mental illness with electricity marries old ideas with modern tech and understanding of the brain – podcast",
        "image": null,
        "video": null,
        "description": null,
        "content": "In deep brain stimulation, electrodes – the pale white lines – are implanted into a patient's brain and connected to a battery in a person's chest. Jmarchn/Wikimedia Commons, CC BY-SAMental illnesses such as obsessive compulsive disorder, depression and addiction are notoriously hard to treat and often don’t respond to drugs. But a new wave of treatments that stimulate the brain with electricity are showing promise on patients and in clinical trials. In this episode of The Conversation Weekly podcast, we talk to three experts and one patient about the history of treating mental illness, how new technology and deeper understanding of the brain are leading to better treatments and where the neuroscience of mental illness is headed next. It’s not uncommon to hear people joke about how their “OCD” makes them want to straighten a crooked picture or clean a smudge on a countertop, but for people actually living with severe obsessive compulsive disorder, the reality is anything but funny. Moksha Patel is a physician and professor at the University of Colorado and has severe OCD. “OCD was really taking over my life. The most obvious of my symptoms were not being able to use any public restrooms, showering for an hour after using the restrooms each time and using chemical cleaners on my skin and my mouth,” he says. After struggling for years, Patel eventually connected with Rachel Davis, a psychiatrist and researcher also at the University of Colorado. Davis suggested that he could be a good candidate for deep brain stimulation as a treatment for his OCD. “Deep brain stimulation involves the implantation of electrodes in the deeper areas of the brain,” Davis explains. These electrodes then transfer into the brain itself small electrical currents that a doctor and their patient try to tune correctly. As Davis explains, “Basically we’re looking to find the settings where the patient feels that their mood is better, their anxiety is less and they have more energy.” Deep brain stimulation works well for a lot of patients and has only started to get mainstream attention in the past decade or so, but ideas underlying this treatment are nearly 60 years old. As explained by Joseph Fins, a neuroethicist and professor of medicine at Wei Cornell Medical College, part of Cornell University in the US, it all started with a Spanish neuroscientist named Jose Manuel Rodriguez Delgado in 1964. “He put a thing called the stimoceiver, a deep brain stimulator, into the brain of a charging bull. And with an electrical current controlled by radio frequency, he was stop the bull in its tracks.” While this work got Delgado on the front page of The New York Times, it came on the heels of a horrific era of mental health treatment that involved lobotomies, electroshock therapy and many other destructive and deeply unethical interventions. So when researchers began to discover drugs that could help people with mental illness, Fins says “psychosurgery and these types of somatic therapies began to fall out of favor and physicians moved away from more physical interventions.” As modern neuroscience led to better understanding of how the brain works, and stigma surrounding physical treatments faded, deep brain stimulation got its second chance in the sun. And as technology has improved, researchers like Jacinta O'Shea, a neuroscientist at the University of Oxford have begun to study a noninvasive technique for stimulating the brain with electricity, called transcranial magnetic stimulation. “If you place a ferromagnetic coil on the scalp and pass a rapidly changing electrical current through that coil, it will induce an electric field that passes painlessly through the skull and into the brain tissue underneath,” O'Shea explains. And just as with deep brain stimulation, these electrical fields can help people overcome mental health issues like depression. Researchers still don’t quite know how deep brain stimulation or transcranial magnetic stimulation work, but with every new treatment, they are learning more about the complicated world of the brain and taking steps toward the treatments of tomorrow. Listen to the full episode of The Conversation Weekly to find out more. This episode was produced and written by Katie Flood and Daniel Merino, with sound design by Eloise Stevens. The executive producer was Gemma Ware. Our theme music is by Neeta Sarl. You can find us on Twitter @TC_Audio, on Instagram at theconversationdotcom or via email. You can also sign up to The Conversation’s free daily email here. A transcript of this episode will be available soon. Listen to The Conversation Weekly via any of the apps listed above, download it directly via our RSS feed, or find out how else to listen here. Jacinta O'Shea has consulted for Welcony Inc and is currently on the Scientific Advisory Board of Plato Science. She receives research funding from the Wellcome Trust/Royal Society and the Academy of Medical Sciences in the U.K. Joseph Fins receives funding from the U.S. National Institutes of Health BRAIN Initiative, Dana Foundation, Greenwall Foundation, Robert Wood Johnson Foundation, Buster Foundation, NIH CTSC, NIH Eunice Kennedy Shriver National Institute of Child Health, Blythedale Children’s Hospital and from numerous editorial boards. He is also the president of the International Neuroethics Society, Chair-Elect and board member of The Hastings Center and a Trustee Emeritus at Wesleyan University. Trustee Emeritus, Wesleyan University.Rachel Davis consults for Medtronic, Inc. She receives funding from the U.S. National Institutes of Health. Moksha Patel has nothing to disclose.",
        "link": "https://theconversation.com/treating-mental-illness-with-electricity-marries-old-ideas-with-modern-tech-and-understanding-of-the-brain-podcast-195071",
        "probability_title": {
            "pos": 0.6969223787428349,
            "neg": 0.30307762125716514
        },
        "probability_description": {
            "pos": 0.8306570810975903,
            "neg": 0.1693429189024097
        }
    },
    {
        "title": "China Expands Lockdowns As COVID Cases Hit Daily Record",
        "image": null,
        "video": null,
        "description": "Residents of eight districts in Zhengzhou, home to 6.6 million people, were told to stay home for five days except to buy food or get medical treatment.",
        "content": "BEIJING (AP) — Pandemic lockdowns are expanding across China, including in a city where factory workers clashed this week with police, as the number of COVID-19 cases hits a daily record. Residents of eight districts of Zhengzhou, home to 6.6 million people, were told to stay home for five days beginning Thursday except to buy food or get medical treatment. Daily mass testing was ordered in what the city government called a “war of annihilation” against the virus. Advertisement During clashes Tuesday and Wednesday, Zhengzhou police beat workers protesting over a pay dispute at the biggest factory for Apple’s iPhone, located in an industrial zone near the city. Foxconn, the Taiwan-based owner of the factory, apologized Thursday for what it called “an input error in the computer system” and said it would guarantee that the pay is the same as agreed to and in official recruitment posters. In the previous 24 hours, the number of new COVID cases rose by 31,444, the National Health Commission said Thursday. That’s the highest daily figure since the coronavirus was first detected in the central Chinese city of Wuhan in late 2019. The daily caseload has been steadily increasing. This week, authorities reported China’s first COVID-19 deaths in six months, bringing the total to 5,232. While the number of cases and deaths is relatively low compared to the U.S. and other countries, China’s ruling Communist Party remains committed to a “zero-COVID” strategy that aims to isolate every case and eliminate the virus entirely. Advertisement Most other governments have ended anti-virus controls and now rely on vaccinations and immunity from past infections to help prevent deaths and serious illness. Businesses and residential communities from the manufacturing center of Guangzhou in the south to Beijing in the north are in various forms of lockdowns, measures that particularly affects blue-collar migrant workers. In many cases, residents say the restrictions go beyond what the national government allows. Guangzhou suspended access Monday to its Baiyun district of 3.7 million residents, while residents of some areas of Shijiazhuang, a city of 11 million people southwest of Beijing, were told to stay home while mass testing is conducted. Beijing opened a hospital in an exhibition center. It suspended access to the Beijing International Studies University after a virus case was found there. Some shopping malls, and office buildings were closed and access was blocked to some apartment compounds. Suggesting some of those measures might be at least semi-permanent, workers were erecting a 2-meter (7-foot)-high fence around the aging, low-rise brick apartment buildings in Beijing’s Hongmiao Beili community. Advertisement A half dozen people in hazmat suits manned the entrance to a lane running through the community, standing behind waist-high steel barriers usually used for crowd control. Authorities had announced measures to try to reduce disruptions from pandemic controls by shortening quarantines and making other changes. Some Chinese have expressed frustration and confusion about the apparent policy flip-flops on social media. While China’s borders remain largely closed, the government has been “optimizing and facilitating the exit and entry process for executives and specialized personnel of multinational companies and foreign businesses and their family members in China,” Foreign Ministry spokesperson Mao Ning said at a daily news conference Thursday. Mao said China would continue to improve various COVID protocols “according to the science-based and targeted principles” to help facilitate travel and cooperation and exchanges with other countries. A key issue is concern about how vulnerable people are to the virus. Few Chinese have caught COVID or even been exposed to the virus, so only a small percentage are thought to have built up effective levels of virus-fighting antibodies. Advertisement China has an overall coronavirus vaccination rate of more than 92%, with most people having received at least one dose. But far fewer older Chinese — particularly those over age 80 — have gotten the shots. The government is trying to contain the latest wave of outbreaks without shutting down factories and the rest of its economy as it did in early 2020. One tactic is using “closed-loop management,” under which workers live in their factories with no outside contacts. Foxconn, the world’s biggest contract assembler of smartphones and other electronics, is struggling to fill orders for the iPhone 14 after thousands of employees walked away from the factory in Zhengzhou last month following complaints about unsafe working conditions. The protests on Tuesday and Wednesday were driven by disagreements over payment of workers who were recruited to replace those who left. Workers scuffled with police and some were beaten. Some were arrested. Foxconn denied what it said were comments online that employees with the virus lived in dormitories at the Zhengzhou factory. It said facilities were disinfected and passed government checks before employees moved in. Advertisement Related COVID-19 China Fauci Criticizes ‘Tireless’ Vaccine Misinfo Spreaders, Says He Will Testify Before GOP House Ice Cube Confirms COVID Vaccine Refusal Cost Him Massive Movie Paycheck Hospitals Slammed With 'Viral Jambalaya' Of Flu, RSV, COVID-19 Marjorie Taylor Greene Sparks Anger With ‘Pure Bloods’ Tweet About Unvaccinated Go To Homepage Before You Go Suggest a correction Popular in the Community You May Like",
        "link": "https://www.huffpost.com/entry/china-lockdowns-covid-expanded_n_637f3f6ee4b082d8e6cde5d3",
        "probability_title": {
            "pos": 0.654698128069438,
            "neg": 0.34530187193056205
        },
        "probability_description": {
            "pos": 0.8195201197615831,
            "neg": 0.18047988023841688
        }
    },
    {
        "title": "A warmer Arctic Ocean leads to more snowfall further south, according to new model",
        "image": "https://scx1.b-cdn.net/csz/news/tmb/2022/a-warmer-arctic-ocean.jpg",
        "video": null,
        "description": "A new model explains that water evaporating from the Arctic Ocean due to a warming climate is transported south and can lead to increased snowfall in northern Eurasia in late autumn and early winter. This information will allow for more accurate predictions of severe weather events.",
        "content": null,
        "link": "https://phys.org/news/2022-11-warmer-arctic-ocean-snowfall-south.html",
        "probability_title": {
            "pos": 0.6111797143832838,
            "neg": 0.3888202856167162
        },
        "probability_description": {
            "pos": 0.6450598312985026,
            "neg": 0.35494016870149736
        }
    },
    {
        "title": "Physicists strike gold, solving 50-year lightning mystery",
        "image": "https://scx1.b-cdn.net/csz/news/tmb/2022/lightning.jpg",
        "video": null,
        "description": "The chances of being struck by lightning are less than one in a million, but those odds shortened considerably this month when more than 4.2 million lightning strikes were recorded in every Australian state and territory over the weekend of 12-13 November.",
        "content": null,
        "link": "https://phys.org/news/2022-11-physicists-gold-year-lightning-mystery.html",
        "probability_title": {
            "pos": 0.745406544156189,
            "neg": 0.254593455843811
        },
        "probability_description": {
            "pos": 0.69949557152176,
            "neg": 0.30050442847824
        }
    },
    {
        "title": "Research reveals accent discrimination in hiring",
        "image": "https://scx1.b-cdn.net/csz/news/tmb/2019/hiring.jpg",
        "video": null,
        "description": "People from minority groups who speak with 'non-standard' accents face discrimination in job interviews, researchers from The University of Queensland have found.",
        "content": null,
        "link": "https://phys.org/news/2022-11-reveals-accent-discrimination-hiring.html",
        "probability_title": {
            "pos": 0.5740822913933881,
            "neg": 0.42591770860661193
        },
        "probability_description": {
            "pos": 0.7288363013952931,
            "neg": 0.2711636986047069
        }
    },
    {
        "title": "Call for harder line on how we judge conservation",
        "image": "https://scx1.b-cdn.net/csz/news/tmb/2020/coral.jpg",
        "video": null,
        "description": "James Cook University scientists say a more direct approach should be taken to conservation planning—with greater focus on the real impact of conservation actions and less attention paid to targets or actions that misrepresent progress.",
        "content": null,
        "link": "https://phys.org/news/2022-11-harder-line.html",
        "probability_title": {
            "pos": 0.7160269683803143,
            "neg": 0.2839730316196857
        },
        "probability_description": {
            "pos": 0.7092694867077811,
            "neg": 0.2907305132922189
        }
    },
    {
        "title": "Elon Musk trolls critics with new 'stay at work' merchandise, following 'woke' discovery",
        "image": "https://static.foxnews.com/foxnews.com/content/uploads/2022/11/THUMB-ELON-TSHIRT-NOV-24-2022.jpg",
        "video": null,
        "description": "Twitter CEO Elon Musk posted a photo of a new t-shirt on his account Wednesday afternoon that seems to troll his critics and others that spoke out against his work policy changes.",
        "content": null,
        "link": "https://www.foxnews.com/tech/elon-musk-trolls-critics-new-stay-work-merchandise-following-woke-discovery",
        "probability_title": {
            "pos": 0.7102810116328712,
            "neg": 0.28971898836712884
        },
        "probability_description": {
            "pos": 0.8411235197353435,
            "neg": 0.15887648026465656
        }
    },
    {
        "title": "Cutting-edge experiments ride SpaceX's 26th CRS mission to space station",
        "image": "https://scx1.b-cdn.net/csz/news/tmb/2022/cutting-edge-experimen.jpg",
        "video": null,
        "description": "SpaceX's 26th commercial resupply mission (CRS) is scheduled to launch to the International Space Station from NASA's Kennedy Space Center in Florida in late November. The Dragon spacecraft carries scientific experiments and technology demonstrations that explore growing plants in space, creating nutrients on-demand, in-space construction, and more.",
        "content": null,
        "link": "https://phys.org/news/2022-11-cutting-edge-spacex-26th-crs-mission.html",
        "probability_title": {
            "pos": 0.7189818456513701,
            "neg": 0.28101815434862987
        },
        "probability_description": {
            "pos": 0.6860394768286097,
            "neg": 0.31396052317139034
        }
    },
    {
        "title": "Astronomers observe intra-group light—the elusive glow between distant galaxies",
        "image": "https://scx1.b-cdn.net/csz/news/tmb/2022/astronomers-observe-in.jpg",
        "video": null,
        "description": "An international team of astronomers have turned a new technique onto a group of galaxies and the faint light between them—known as 'intra-group light'—to characterize the stars that dwell there.",
        "content": null,
        "link": "https://phys.org/news/2022-11-astronomers-intra-group-lightthe-elusive-distant.html",
        "probability_title": {
            "pos": 0.7899059623441342,
            "neg": 0.21009403765586576
        },
        "probability_description": {
            "pos": 0.802273901921832,
            "neg": 0.197726098078168
        }
    },
    {
        "title": "Underwater tsunamis created by glacier calving cause vigorous ocean mixing",
        "image": "https://scx1.b-cdn.net/csz/news/tmb/2022/underwater-tsunamis-cr-1.jpg",
        "video": null,
        "description": "Scientists on a research vessel in Antarctica watched the front of a glacier disintegrate and their measurements \"went off the scale.\" As well as witnessing disruptions on the ocean surface, they recorded \"internal\" underwater tsunamis as tall as a house, a phenomenon that has been previously missed in the understanding of ocean mixing and in computer models.",
        "content": null,
        "link": "https://phys.org/news/2022-11-underwater-tsunamis-glacier-calving-vigorous.html",
        "probability_title": {
            "pos": 0.7073525229508085,
            "neg": 0.2926474770491915
        },
        "probability_description": {
            "pos": 0.8506607084015232,
            "neg": 0.14933929159847686
        }
    },
    {
        "title": "Surveys show public is willing to pay larger energy bills in solidarity with Ukraine",
        "image": "https://scx1.b-cdn.net/csz/news/tmb/2022/ukraine-1.jpg",
        "video": null,
        "description": "Russia's invasion of Ukraine in February led to demonstrations and donations all over the world. The yellow-blue flag of Ukraine fluttered against the sky thousands of kilometers away. People raised money, and volunteers signed up to help refugees and provide shelter.",
        "content": null,
        "link": "https://phys.org/news/2022-11-surveys-pay-larger-energy-bills.html",
        "probability_title": {
            "pos": 0.7002970607474632,
            "neg": 0.29970293925253677
        },
        "probability_description": {
            "pos": 0.850423710532239,
            "neg": 0.14957628946776097
        }
    },
    {
        "title": "Scientists demonstrate world's first continuous-wave lasing of deep-ultraviolet laser diode at room temperature",
        "image": "https://scx1.b-cdn.net/csz/news/tmb/2022/in-world-first-scienti-1.jpg",
        "video": null,
        "description": "A research group led by 2014 Nobel laureate Hiroshi Amano at Nagoya University's Institute of Materials and Systems for Sustainability (IMaSS) in central Japan, in collaboration with Asahi Kasei Corporation, has successfully conducted the world's first room-temperature continuous-wave lasing of a deep-ultraviolet laser diode (wavelengths down to UV-C region).",
        "content": null,
        "link": "https://phys.org/news/2022-11-scientists-world-continuous-wave-lasing-deep-ultraviolet.html",
        "probability_title": {
            "pos": 0.7049970701946304,
            "neg": 0.2950029298053696
        },
        "probability_description": {
            "pos": 0.6721958002231725,
            "neg": 0.32780419977682757
        }
    },
    {
        "title": "What is a chief metaverse officer and why are companies like Disney and P&G appointing one?",
        "image": null,
        "video": null,
        "description": "To be ready for the metaverse, your company might need a chief metaverse officer (CMTO), someone who has both vision and technical expertise.",
        "content": "To be ready for the metaverse, your company might need a chief metaverse officer (CMTO), someone who has both vision and technical expertise.Read More",
        "link": "https://venturebeat.com/virtual/what-is-a-chief-metaverse-officer-and-why-do-you-need-one/",
        "probability_title": {
            "pos": 0.6077860021644358,
            "neg": 0.3922139978355642
        },
        "probability_description": {
            "pos": 0.7786414296020329,
            "neg": 0.22135857039796714
        }
    },
    {
        "title": "How should we prepare for an ageing global population?",
        "image": "https://i.guim.co.uk/img/media/b498980486f161cd1f876d520d5e43dd83aee6db/0_223_5616_3370/master/5616.jpg?width=460&quality=85&auto=format&fit=max&s=e4dda8f3f2f81324af52b8d584418b7a",
        "video": null,
        "description": "On 15 November the world’s population reached 8 billion, according to the UN. Much of that growth is because we’re living longer. As a species we will continue to age, but eventually stop growing. The UN predicts that in the next century humanity will begin to go into decline. So what happens when societies get older and smaller – a problem some countries are already encountering? Ian Sample speaks to Prof Vegard Skirbekk about how humanity got here, and how we prepare for future demographic changeArchive: ANC 24/7, BBC News, euronews Continue reading...",
        "content": null,
        "link": "https://www.theguardian.com/science/audio/2022/nov/24/how-should-we-prepare-for-an-ageing-global-population",
        "probability_title": {
            "pos": 0.6617749665670631,
            "neg": 0.33822503343293686
        },
        "probability_description": {
            "pos": 0.7316012286842937,
            "neg": 0.26839877131570633
        }
    },
    {
        "title": "Planet's most unique birds at higher risk of extinction: Study of 99% of all living bird species",
        "image": "https://scx1.b-cdn.net/csz/news/tmb/2022/planets-most-unique-bi.jpg",
        "video": null,
        "description": "A new study finds that bird species with extreme or uncommon combinations of traits face the highest risk of extinction. The findings are published in the journal Functional Ecology.",
        "content": null,
        "link": "https://phys.org/news/2022-11-planet-unique-birds-higher-extinction.html",
        "probability_title": {
            "pos": 0.7208131104105503,
            "neg": 0.2791868895894497
        },
        "probability_description": {
            "pos": 0.6046002292264618,
            "neg": 0.3953997707735382
        }
    },
    {
        "title": "Winston Duke and Lupita Nyong'o Were Contenders to Become New Black Panther in 'Wakanda Forever'",
        "image": "https://img.buzzfeed.com/buzzfeed-static/static/2022-11/24/4/tmp/5658236f5fef/tmp-name-3-3540-1669263632-0_dblbig.jpg",
        "video": null,
        "description": "'Black Panther: Wakanda Forever' co-writer Joe Robert Cole says M'Baku and Nakia were both considered as the one to claim T'Challa's mantle.View Entire Post ›",
        "content": null,
        "link": "https://www.complex.com/pop-culture/a/jose-martinez/winston-duke-lupita-nyongo-become-new-black-panther-wakanda-forever",
        "probability_title": {
            "pos": 0.43888072567906633,
            "neg": 0.5611192743209337
        },
        "probability_description": {
            "pos": 0.7152772325631597,
            "neg": 0.28472276743684033
        }
    },
    {
        "title": "James Van Der Beek Says Daughter Uses 'Dawson's Creek' Crying Meme on Him",
        "image": "https://img.buzzfeed.com/buzzfeed-static/static/2022-11/24/2/tmp/23336c065553/tmp-name-3-3497-1669256768-0_dblbig.jpg",
        "video": null,
        "description": "James Van Der Beek revealed that his eldest daughter has not only discovered his crying meme from 'Dawson's Creek,' but has used it against him.View Entire Post ›",
        "content": null,
        "link": "https://www.complex.com/pop-culture/a/jose-martinez/james-van-der-beek-daughter-uses-dawsons-creek-crying-meme",
        "probability_title": {
            "pos": 0.7092037075124857,
            "neg": 0.2907962924875143
        },
        "probability_description": {
            "pos": 0.8095131008803768,
            "neg": 0.19048689911962324
        }
    },
    {
        "title": "Russo Brothers and Amazon Making Limited Series About Collapse of FTX Cryptocurrency Exchange",
        "image": "https://img.buzzfeed.com/buzzfeed-static/static/2022-11/24/1/tmp/23336c065553/tmp-name-3-3409-1669251942-7_dblbig.jpg",
        "video": null,
        "description": "Joe and Anthony Russo will collaborate with 'Hunters' creator David Weil on an eight-part limited series about the FTX cryptocurrency scandal for Amazon Prime.View Entire Post ›",
        "content": null,
        "link": "https://www.complex.com/life/a/jose-martinez/russo-brothers-amazon-series-collapse-ftx-cryptocurrency-exchange",
        "probability_title": {
            "pos": 0.8052737350673087,
            "neg": 0.19472626493269124
        },
        "probability_description": {
            "pos": 0.8194769096565082,
            "neg": 0.18052309034349173
        }
    },
    {
        "title": "Thanksgiving travel rush is back after two years of COVID-19 restrictions",
        "image": "https://www.chicagotribune.com/resizer/5xwtvC3xI5TtfJBn8bcnmFZlw-8=/cloudfront-us-east-1.images.arcpublishing.com/tronc/5BJNA3FCKM7TPI4GUQ5ECGRFNY.jpg",
        "video": null,
        "description": "The holiday travel rush is already on, and it could spread out over more days than usual this year.",
        "content": "The holiday travel rush is already on, and it could spread out over more days than usual this year.",
        "link": "https://www.chicagotribune.com/nation-world/ct-aud-nw-thanksgiving-travel-20221124-rvl3f27pm5dn7kqvqm7cyxmrqu-story.html#ed=rss_www.chicagotribune.com/arcio/rss/category/nation-world/",
        "probability_title": {
            "pos": 0.6553022857589057,
            "neg": 0.3446977142410943
        },
        "probability_description": {
            "pos": 0.7677721693854315,
            "neg": 0.23222783061456853
        }
    },
    {
        "title": "Kanye West Is Now Allegedly Sharing Sexually Graphic Images Of Kim Kardashian Without Her Consent",
        "image": "https://img.buzzfeed.com/buzzfeed-static/static/2022-11/23/23/asset/5658236f5fef/sub-buzz-3300-1669246631-2.jpg?resize=720:1080",
        "video": null,
        "description": "There’s been a long-standing battle between Kim’s exes — Ray J and Kanye West — over who owns her sexual image. The reality is no one does, and yet we’re all still fighting over it.View Entire Post ›",
        "content": "Culture & Criticism Celebrity Kanye Is Allegedly Sharing Explicit Images Of Kim Kardashian Without Consent There’s been a long-standing battle between Kim’s exes — Ray J and Kanye West — over who owns her sexual image. The reality is no one does, and yet we’re all still fighting over it. By by Scaachi Koul BuzzFeed News Reporter Updated 27 minutes ago Posted 1 hour ago Twitter Facebook Link Stefanie Keenan / Getty Images for SKKN BY KIM Kim Kardashian visits the SKKN by Kim holiday pop-up store at Westfield Century City Mall on November 16, 2022, in Century City, California. Kanye West is now irredeemable. This isn’t up for debate anymore. In the scope of just the last few months, Ye (which he legally changed his name to last year) has done the kind of damage that one can’t easily come back from. His behavior is finally receiving reproach from collaborators , his art is forever tarnished, and his personal life is a graveyard of misdeeds. And while Ye has a history of erratic and harmful behavior, he’s only begun to see meaningful repercussions for it. Even so, he remains far from canceled — whatever that means. (Earlier this week, when he appeared unannounced at ComplexCon in Long Beach, a BuzzFeed event, fans were so excited to see him that there was nearly a stampede.) According to a recent report from Rolling Stone , Ye’s behavior has allegedly been escalating for a while. And given the history of his public misogyny, that’s not entirely surprising. Last month, he uploaded a 30-minute “ documentary ” to YouTube, in which he shows Adidas executives porn on his phone during a business meeting. That’s already wildly inappropriate, but according to the Rolling Stone story, Ye also allegedly showed an intimate photo of his ex-wife, Kim Kardashian, to a potential employee, and an “explicit video” of her to Yeezy creatives in 2018. Kardashian has yet to make any public statements around these particular allegations. Ye has not publicly commented on the veracity of the allegations either. (BuzzFeed News reached out to Adidas and Ye directly for comment. CAA recently dropped him from their talent roster. ) These alleged acts are a kind of sexual violence in themselves, a potent way of wresting control from Kardashian. Is it surprising that there are claims about Ye using imagery of his then-wife’s body this way? Not really; without her permission, these alleged acts are a kind of sexual violence in themselves, a potent way of wresting control from Kardashian and turning her into a hypersexualized pawn again. (Not to mention how inappropriate it is to show sexual material to other people without the viewer’s consent.) But it would have been easy for him to do it, largely because the public already looks at Kardashian in an exploitative way. And while it’s perfectly acceptable for her to sexualize herself if she chooses to, it would be a violation if someone else did it without her explicit consent, never mind her awareness. The recent allegations in Rolling Stone also track given the history of how Ye talks about women, including women he, apparently, gladly slept with and dated. (Or his own admission of having a porn addiction .) In 2015, he said, “It’s very hard for a woman to want to be with someone that’s with Amber Rose — I had to take 30 showers before I got with Kim.” (Rose, Ye’s former girlfriend, ended up organizing the 2015 Slut Walk , a kind of public protest around how sexually active women, or just any woman, is treated publicly.) Some of Ye’s cruelest behavior has targeted Black women. His ongoing support of Donald Trump, his Tucker Carlson interview, his “White Lives Matter” T-shirts during the YZY Season 9 fashion show feel designed to distress Black women in particular. In October, Vogue editor Gabriella Karefa-Johnson criticized the White Lives Matter shirts . “There is no excuse, there is no art here,” she said on Instagram. Ye responded by bullying her online, taking particular umbrage at her appearance . Of course he did; it’s the tactic of the weak. At least he still has Candace Owens . The alleged acts also have connective tissue with his antisemitic remarks . It’s not a huge leap; men who treat women as if they’re disposable usually find other ways to act out with rage. Ye has continuously said hateful things about the Jewish community , like when he ranted about how, actually, Hitler made some good points . His hate speech has activated others to spread antisemitism — after one of his many Twitter screeds, a banner saying “ Kanye is right about the Jews ” was hung over an LA freeway with people giving the Nazi salute beside it. And now that Ye has been reinstated on Twitter, users worry that he will continue to incite hate and even violence. And what’s unsettling is the relatively muted public response to this new development in particular. Then again, Kardashian isn’t a very “good” victim. The public has repeatedly deemed her too invested in self-promotion to be fully viewed with empathy when men mistreat her. This isn’t even the first time Ye has publicly humiliated Kardashian or the other female members of his family — while on the campaign trail for his failed 2020 presidential run, he suggested she had wanted to abort their daughter North and accused matriarch Kris Jenner of encouraging Kim and Kylie to appear in “Playboy and sex tapes.” Phillip Faraone / Getty Images for Baby2Baby Kim Kardashian at the Pacific Design Center on November 12, 2022, in West Hollywood, California. And above all, the early narrative around their relationship — that Ye was a genius tying his wagon to a shameless fame-whore, whore being the operative word, always — still persists. It’s her fault he’s like this now . Just like the other men in the Kardashian orbit, from Lamar Odom to Tristan Thompson, Ye fell to the Kardashian Kurse. But Tristan Thompson didn’t cheat on Khloé Kardashian because she cursed him; he did it because he’s compulsive and cruel. Ye’s billion-dollar empire didn’t falter because of his divorce; it faltered because of his own behavior. For years, Kardashian’s sexuality has been a topic up for grabs by just about anyone. The public has felt a sense of ownership since her sex tape was released in 2007. There remains long-standing debate over who is responsible for its release. And while her ex-boyfriend, Ray J, continues to dredge up the tape, as recently as September , he has never had to contend with even half of the backlash that Kardashian has. But arguing yet again that men don’t face the same consequences for sexual acts that women do is practically mundane. The reality is that no one owns Kardashian’s body but herself — and she should have some reasonable expectation of privacy from someone who was once her husband and is still the father of her children. Ye taking that from her is a bilious kind of humiliation. It seems especially egregious given his very public overture of “rescuing” the remaining footage of her Ray J sex tape as a gift to her, followed by her tearful relief and gratitude. It feels so empty now, doesn’t it? Kim has the right to privacy regardless of how many sex tapes she might appear in, how many Instagram posts she publishes showing her body in various states of undress, whatever photos of herself she sent to her own husband. But the debate endures: Is she Ray J’s property, Ye’s property, or ours? The worst kind of men marry women and then convert them into objects to sexualize as they see fit — or weaponize their sexuality against them. The worst kind of husbands view their wives not as partners or equals, but indeed as their rib, ripped out and morphed into a body they can treat however they want. It’s clear that Ye views a lot of the forces and people around him as available to him in his pursuit of pleasure, success, or control. Why would he treat Kim any differently? ● More on this Kanye West Has Been Accused Of Showing Adidas Employees His Homemade Sex Tapes And “Explicit” Videos Of Kim Kardashian Stephanie Soteriou · 12 hours ago Kanye West Destroyed His Billion-Dollar Empire In Just Three Weeks. Here’s How He Did It. Ade Onibada · Oct. 28, 2022 How Kimye Fell From Grace Ellen Durney · Oct. 5, 2022 Topics in this article Celebrity Pop culture Kim Kardashian Scaachi Koul BuzzFeed News Reporter Scaachi Koul is a senior culture writer for BuzzFeed News and is based in New York. Contact Scaachi Koul at scaachi.koul@buzzfeed.com . Got a confidential tip? 👉 Submit it here incoming Your weekday morning guide to breaking news, cultural analysis, and everything in between Newsletter signup form Email Address Sign up This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply.",
        "link": "https://www.buzzfeednews.com/article/scaachikoul/kanye-west-kim-kardashian-explicit-rolling-stone",
        "probability_title": {
            "pos": 0.7006038257680265,
            "neg": 0.2993961742319735
        },
        "probability_description": {
            "pos": 0.8671918222532246,
            "neg": 0.13280817774677545
        }
    },
    {
        "title": "Thanksgiving according to whom?",
        "image": "https://twt-thumbs.washtimes.com/media/image/2022/11/23/B1thomasLGhratitude_s743x929.jpg?ffb8d13c7a049f99118b23b64d048f07c00a05d5",
        "video": null,
        "description": "One definition of \"thanksgiving\" is this: \"Public celebration acknowledging divine favors.\" The word implies an object to whom thanks should be given.",
        "content": "Print Commentary By Cal Thomas - - Wednesday, November 23, 2022 OPINION: Merriam-Webster has announced it is adding about 500 new words to its seventh edition of the Official Scrabble Players Dictionary. I doubt most people will ever use them in conversation or in writing, but they will be beneficial when playing the board game. Meanwhile, the corruption of the English language continues. Some words (and their usage), which might be better known than these new Scrabble entries, continue to be misapplied (a great 10-letter word) while pronouns and nouns are increasingly used in the same sentence, in violation of sound grammar rules. One exchange that seems particularly grating — and doubly so, especially at Thanksgiving — goes like this: Me: Thank you. Person to whom thanks is given: “No problem.” Why should anyone consider an expression of thanks a problem? What happened to “you’re welcome”? And why do so many spell the contraction of you and are as your? English teachers take note. I digress, but only partially (nine letters). One definition of “thanksgiving” is this: “Public celebration acknowledging divine favors.” The word implies an object to whom thanks should be given. In our increasingly secular age in which growing numbers of especially young people claim no belief in God, or are indifferent to Him, to whom will they give thanks? The person who prepared the meal? What if the hosts ordered dinner from a store? I doubt those feasting on the repast would thank store employees. True, some churches will hold services on the day, and many will pray and give thanks to God before violating whatever diet they are on, or the advice of their doctors about cholesterol. Those who first came to America credited God for his blessed favor. Though many died from various causes in the early 17th century, those who survived expressed their gratitude to the One who brought them safely here and sustained them. So it was with William Bradford, the first governor of Massachusetts, who issued a proclamation on Nov. 29, 1623, which read in part: “[T]he great Father has given us this year an abundant harvest of Indian corn, wheat, peas, beans, squashes, and garden vegetables, and has made the forests to abound with game and the sea with fish and clams, and inasmuch as he has protected us … spared us from pestilence and disease, has granted us freedom to worship God, according to the dictates of our own conscience.” In the middle of the horrific Civil War, Abraham Lincoln found something for which to be thankful as he established Thanksgiving as an official national holiday. While Lincoln issued the proclamation, credit for the holiday must go to Sarah Josepha Hale, who edited a publication called “Godey’s Lady’s Book,” a popular women’s magazine in the 19th century. Hale repeatedly urged Lincoln to formalize the day, which he did in 1863. While noting that no foreign nation had taken advantage of America’s division and that harvests continued to be plentiful, Lincoln wrote: “It has seemed to me fit and proper that they should be solemnly, reverently, and gratefully acknowledged as with one heart and one voice by the whole American people.” And so it was and so it has been ever since. The word thanksgiving is too long for the Scrabble letters on one’s tray, but its synonym gratitude will fit. You might even land on a triple-word score. But more than that, you will be expressing something that seems in all too short supply today to the One who deserves our thanks and praise for the undeserved blessings He has bestowed on America. • Readers may email Cal Thomas at tcaeditors@tribpub.com. Look for Cal Thomas’ latest book, “America’s Expiration Date: The Fall of Empires and Superpowers and the Future of the United States” (HarperCollins/Zondervan). Copyright © 2022 The Washington Times, LLC. Click here for reprint permission . Please read our comment policy before commenting. Click to Read More and View Comments Click to Hide",
        "link": "https://www.washingtontimes.com/news/2022/nov/23/thanksgiving-according-to-whom/?utm_source=RSS_Feed&utm_medium=RSS",
        "probability_title": {
            "pos": 0.6664901846424568,
            "neg": 0.3335098153575432
        },
        "probability_description": {
            "pos": 0.8758049842081814,
            "neg": 0.12419501579181863
        }
    },
    {
        "title": "Some fun facts about Thanksgiving",
        "image": "https://twt-thumbs.washtimes.com/media/image/2022/11/23/B1ebsteinLGtdaycomeback_s743x929.jpg?ffb8d13c7a049f99118b23b64d048f07c00a05d5",
        "video": null,
        "description": "I recently learned something I hadn't fully appreciated. Parents of Generation Zers told me their children don't want to celebrate the Thanksgiving holiday because of our history with Indigenous Americans.",
        "content": "Print Commentary By Jill Ebstein - - Wednesday, November 23, 2022 OPINION: I recently learned something I hadn’t fully appreciated. Parents of Generation Zers told me their children don’t want to celebrate the Thanksgiving holiday because of our history with Indigenous Americans. History has a long arc, and we have the opportunity along the way to learn and do better. With that in mind, I offer my 2022 take on Thanksgiving. First, some fun turkey trivia, which might help lighten the mood. Question 1: Whom do we thank for declaring Thanksgiving a national holiday? Answer: The generally recognized first Thanksgiving happened in 1621, likely with no turkey. It wasn’t until 1863, when Sarah Josepha Hale, who wrote “Mary Had a Little Lamb,” petitioned President Abraham Lincoln that it became a national holiday. Ms. Hale’s nickname? “Mother of Thanksgiving.” Question 2: When was the first Macy’s Thanksgiving Day Parade? Answer: The first parade was in 1924 and was called the “Macy’s Day Christmas parade,” hoping to spark holiday shopping. The parade included monkeys, bears, camels and elephants taken from Central Park Zoo — and no character balloons. Snoopy, where were you? Question 3: How many turkeys are consumed on Thanksgiving. Answer: It’s estimated that 46 million turkeys are cooked. How many are fully consumed is a different answer. Instacart says that 68% of Americans don’t actually like turkey and its side dishes. Question 4: What is this holiday’s one lasting contribution to American culture that has spanned decades and will continue? Answer: Frozen TV dinners. In 1953, Swanson completely overestimated the number of turkeys to be ordered, leaving them with 260 extra tons of turkey! Swanson turned its mistake into an opportunity, creating reheatable turkey dinners packaged in individual trays. Swanson sold 10 million frozen turkey dinners in 1953, and the frozen TV dinner was born. And now for my message that is more than the long arc of history: In 2022, I am grateful that comebacks are possible. Clearly, we are still trying to come back from COVID-19. All the qualifiers in that sentence will attest to the challenge — “still,” “process” and “trying.” But I believe in comebacks. They happen. I live in Boston and was fortunate enough to see the Red Sox come back to win the 2004 ALCS after being down three games and on the brink of elimination. From there, they clinched the World Series. More recently, in 2020, the Chicago Cubs came back from a 3-1 deficit to win their first World Series in 108 years. In our own lives, we are experiencing comebacks. Restaurants are open. Travel is happening. Some people are eating indoors at other people’s homes. It is true that the dinner menu itself is designed based on what the stores have in stock because the supply chain is still lumbering, but who really cares? At our turkey dinner, I am going to ask people to remember a meaningful comeback that they experienced. It could be as significant as recovering from a health episode or as emotionally demanding as rescuing a failed project at work. It could be as silly as the spice turmeric, which is making a comeback in our diets. Oh, the places you can go. One of my favorite comebacks concerns Ernest Hemingway, a prolific and highly respected author in the 1930s. Then he had a bad stretch, going 10 years without publishing a novel before releasing “Across the River and Into the Trees,” which was panned. Hemingway was depressed, and his reputation was in ruin. In 1953, he wrote “The Old Man and the Sea,” which drew parallels between Hemingway’s failures and his unsuccessful fisherman protagonist. It won him the Nobel Prize. Reputation restored. Comebacks are everywhere, and they are inspiring, which brings me back to the turkey on Thanksgiving Day. Turkeys are celebrated as the cornerstone of our Thanksgiving holiday. Benjamin Franklin is on record for wishing that the turkey, which he dubbed a “respectable bird,” had been the national bird used to represent our country. Yet for all its glory and grace, most Americans don’t like turkey, which gets only one day of prominence all year. It might be a literary stretch to call the turkey a “comeback pheasant,” but it has found a niche in our culture and symbolizes a day of gratitude and love. To this, I say, “Pass the turkey, pass the gratitude, and relish the comeback while we toast nearing the end of a challenging year.” • Jill Ebstein is the editor of the “At My Pace” series of books and the founder of Sized Right Marketing, a consulting firm. Copyright © 2022 The Washington Times, LLC. Click here for reprint permission . Please read our comment policy before commenting. Click to Read More and View Comments Click to Hide",
        "link": "https://www.washingtontimes.com/news/2022/nov/23/some-fun-facts-about-thanksgiving/?utm_source=RSS_Feed&utm_medium=RSS",
        "probability_title": {
            "pos": 0.7748080441106873,
            "neg": 0.22519195588931268
        },
        "probability_description": {
            "pos": 0.795602230853242,
            "neg": 0.20439776914675795
        }
    },
    {
        "title": "The Hispanic 'anti-red wave' against Biden's Latin America policy",
        "image": "https://twt-thumbs.washtimes.com/media/image/2022/11/23/B3-CLAV-Anti-Wave-GG_s1440x1085.jpg?1d7626e0b3076985c958a902e72948f6f147f5d5",
        "video": null,
        "description": "While much of the post-election bickering focused on imaginary \"red waves\" and \"blue walls,\" there was a very real \"anti-red wave\" that swept Florida.",
        "content": "Print Commentary By Mauricio Claver-Carone - - Wednesday, November 23, 2022 OPINION: While much of the post-election bickering focused on imaginary “red waves” and “blue walls,” there was a very real “anti-red wave” that swept Florida. It was led by Hispanic voters, who delivered a historic victory to Republican candidates across the state while delivering a striking rebuke to the Biden administration’s policy of appeasement of communist dictators, socialist governments and China’s expansion in Latin America and the Caribbean. Home to the country’s largest diasporas of Americans of Cuban, Venezuelan, Nicaraguan and Colombian descent, among others, these communities in Florida have rallied around the leadership of Gov. Ron DeSantis, Sen. Marco Rubio and House members such as Reps. Mario Diaz-Balart and Maria Elvira Salazar in an effort to counter the Biden administration’s obsession with dismantling policies — regardless of the consequences — that were designed during the Trump administration to pressure and contain America’s foes in the region, while strengthening and rewarding America’s friends. The contrast in approaches couldn’t be more stark. Last week, Venezuelan dictator Nicolas Maduro strolled the halls of the COP-27 climate summit in Egypt, carefree, as he chatted up the likes of French President Emmanuel Macron and U.S. envoy John Kerry. This would have been unthinkable just two years ago, when we led the largest coalition for democracy since World War II, with nearly 80 countries recognizing the legitimate constitutional government of interim President Juan Guaido, and designed one of the most comprehensive set of sanctions ever, including toward PdVSA, the Venezuelan oil company used as a piggy bank to bolster socialist regimes across the region. Mr. Maduro was also indicted on narcoterrorism charges, and a $15 million bounty was placed on his capture. The pressure was so unbearable that just weeks before the November 2020 election, Mr. Maduro sent an envoy to discuss Caribbean locations for his exile, if President Donald Trump won reelection. Meanwhile, in July 2021, the Cuban people led nationwide protests inspired by the theme “Patria y Vida” (“Homeland and Life”) against a regime that was severely crippled by new sanctions. These Trump-era sanctions strategically targeted the military’s monopoly over the economy, and for the first time since the Libertad Act’s 1996 enactment authorized Title III lawsuits against foreign companies that trafficked in properties stolen from Americans. Yet Cuban President Miguel Diaz-Canel’s regime brutally suppressed these protests, and hundreds of democracy advocates remain in prison without consequence. To the contrary, the Biden administration now seeks to normalize relations with both Messrs. Diaz-Canel and Maduro. In Nicaragua, emboldened by the impunity of his allies in Caracas and Havana, President Daniel Ortega has fully transitioned to a totalitarian dictator and arrested every potential opposition candidate and even clergy. This is a far cry from Mr. Ortega’s desire to negotiate a democratic transition under the weight of our 2019 executive order and the Nica Act, which authorized and implemented sanctions against his energy and financial services conglomerates. Dictatorships aside, an ideological “red wave” of elected socialist governments has also swept the region, thanks to the flagrant inconsistencies of the Biden administration, which rewards the region’s critics of U.S. policy toward Russia and Venezuela, like Mexico and Argentina, with White House visits, while it won’t even afford minimal commercial advantages to allies in Ecuador and Uruguay. It celebrates the election of “former” terrorist Gustavo Petro in Colombia with a phone call from President Biden within the hour, after previously keeping his center-right predecessor, Iván Duque, on ice without contact for months. The Biden administration never had a kind word for Brazilian President Jair Bolsonaro and has accused Central American leaders of being corrupt — yet oozes excitement over the recent election of Brazilian socialist leader Lula da Silva, the most corrupt politician in the modern history of the region. This creates fertile ground for China to further expand. In December 2019, we launched an initiative named “America Crece” (“Growth in the Americas”), which was composed of energy and infrastructure agreements with countries to stimulate and secure U.S. investment in these sectors, and counter Chinese state-owned entities. From its inception until January 2021, 16 countries in the region signed “America Crece” agreements, while the last Belt and Road deal with China in the region was signed in April 2019. In other words, the U.S. ran the scoreboard 16-0. Unfortunately, it was terminated on day one by the Biden administration, along with a timely “nearshoring” initiative, due solely to partisan shortsightedness. Meanwhile, at the Inter-American Development Bank (IDB), which China joined in 2009 after paying a highly questionable $350 million “kickback,” the three Chinese funds created to co-finance nearly 100 projects in Latin America and the Caribbean with over $6 billion of IDB money over the past decade — of which U.S. taxpayers outrageously paid 30% of the bill — were finally shut down. This issue is ripe for a congressional investigation of how it ever happened. Instead, the Biden administration is looking to reinstate these Chinese funds. The new Congress and its leaders, both Republicans and Democrats, would be wise to heed the call of the Hispanic “anti-red” wave and prioritize efforts to recalibrate Mr. Biden’s mistaken policies toward the hemisphere. As the adage goes, “good policy is good politics.” • Mauricio Claver-Carone was deputy assistant to the president and senior director for Western Hemisphere affairs at the National Security Council from 2018 to 2020. He was president of the Inter-American Development Bank from 2020 to 2022. Copyright © 2022 The Washington Times, LLC. Click here for reprint permission . Please read our comment policy before commenting. Click to Read More and View Comments Click to Hide",
        "link": "https://www.washingtontimes.com/news/2022/nov/23/hispanic-anti-red-wave-against-bidens-latin-americ/?utm_source=RSS_Feed&utm_medium=RSS",
        "probability_title": {
            "pos": 0.9330457911473169,
            "neg": 0.06695420885268316
        },
        "probability_description": {
            "pos": 0.8589208057374278,
            "neg": 0.14107919426257226
        }
    },
    {
        "title": "With JWST Fully Operational Again, we get Images Like This: Saturn’s Moon Titan",
        "image": "https://www.universetoday.com/wp-content/uploads/2022/11/Screenshot-2022-11-23-at-15-14-28-Emily-Lakdawalla-on-Twitter.jpg",
        "video": null,
        "description": "The James Webb's mid-infrared instrument (MIRI) is back online, and took a new image of Saturn's largest moon Titan! The post With JWST Fully Operational Again, we get Images Like This: Saturn’s Moon Titan appeared first on Universe Today.",
        "content": "On August 24th, a vital instrument aboard the James Webb Space Telescope (JWST) experienced a malfunction that prompted the mission team to take it offline. The problem occurred when the Mid-Infrared Instrument (MIRI) experienced increased friction in one of its wheels while in Medium-Resolution Spectroscopy (MRS) mode. The mission team took MIRI offline while they attempted to diagnose the problem, leaving the observatory to continue making observations in other modes. This came shortly after Webb was hit by a large micrometeoroid in late May that caused damage to one of its primary mirror segments. Luckily, the damage this caused will not alter the telescope’s performance, and the mission team announced earlier this month that they had restored the MIRI to operational status. With everything in the green, Webb has once again turned its infrared optics to the cosmos and acquired some breathtaking images. This includes a new image of Saturn’s largest moon Titan, which recently appeared online. Titan as seen by #JWST ?(up-scaled 2x, and using a VIMS-ish colormap, R = 1.4 um, G = 2.1 um, B = 4.8 um) pic.twitter.com/wF8lQeNGVv— Michael Radke (@RadPlanets) November 15, 2022 The image was processed and uploaded to Twitter by Michael Radke, a Ph.D. student who studies planetary atmospheres using laboratory photochemistry experiments at John Hopkins University (JHU). According to Radke, the image was acquired between November 4th and 5th, which he doubled in scale and added red, green, and blue to represent different wavelengths (R = 4.8 um, G = 2.1 um, B = 1.4 um). These values were based on the Cassini mission’s Visible and Infrared Mapping Spectrometer (VIMS). These colors appear to correspond to the absorption spectrum of carbon monoxide (green), methane (blue), and nitrogen (red), the gases that make up the majority of Titan’s atmosphere. Titan also appears to be illuminated from the upper left in the image, which creates the impression of a sunrise. Planetary scientist, author, and space journalist Emily Lakdawalla suggested that the source could be light reflected from Saturn’s atmosphere. This image also provides a glimpse of the types of science operations Webb will conduct with Titan and other bodies in our Solar System. Its powerful instruments and near- and mid-infrared imagining capabilities will allow astronomers to study the chemical composition of atmospheres in detail. Titan is of particular interest because it is the only moon in our atmosphere with a substantial atmosphere – where the air pressure is roughly 50% greater than Earth’s. Like Earth, TItan’s atmosphere is predominantly composed of nitrogen gas (94%), with hydrocarbons like methane making up the second largest fraction (5.65%). Titan is the only other body in the Solar System with a precipitation and evaporation cycle. Whereas Earth has a water cycle, Titan has a methane cycle, where methane forms clouds in the moon’s atmosphere, falls to the surface as rain, and replenishes methane lakes. In addition, Titan’s atmosphere is rich in chemical processes as hydrocarbons are broken down by solar radiation into their constituents (i.e., carbon, hydrogen, oxygen, and nitrogen) and then form new molecules that percolate and settle on the surface. Titan’s atmosphere and surface also possess something that no body other than Earth does: a rich prebiotic environment and organic chemistry. For this reason, astrobiologists have suspected that Titan may be one of the most promising places to search for extraterrestrial life. For these reasons, Webb needs its instruments in working order, particularly MIRI and the Near-Infrared Spectrograph (NIRSpec). These will obtain high-precision spectra from Titan’s atmosphere to observe these molecules and processes at work. These studies will build on previous efforts by the joint NASA-ESA Cassini-Huygens mission, which studied Saturn and its satellites from 2004 to 2017. Both the orbiter and lander studied Titan’s atmosphere in depth and made many profound discoveries. The more detailed information that Webb will obtain will be used to study Titan’s seasonal cycles, leading to more detailed climatic models. This will help pave the way for missions like NASA’s Dragonfly rotorcraft that will launch for Titan in 2027, arriving sometime in the 2030s. The post With JWST Fully Operational Again, we get Images Like This: Saturn’s Moon Titan appeared first on Universe Today.",
        "link": "https://www.universetoday.com/158722/with-jwst-fully-operational-again-we-get-images-like-this-saturns-moon-titan/",
        "probability_title": {
            "pos": 0.6619056662676879,
            "neg": 0.33809433373231207
        },
        "probability_description": {
            "pos": 0.762915422612378,
            "neg": 0.237084577387622
        }
    },
    {
        "title": "Quick tech tricks to make the busy holiday season easier",
        "image": "https://static.foxnews.com/foxnews.com/content/uploads/2022/11/GettyImages-1244042011.jpg",
        "video": null,
        "description": "The holidays don't have to be stressful if you internalize these tech tips which will help you keep track of your luggage, avoid overpaying, and more.",
        "content": "close Video UK-based tech company digitizing textbooks for online use America is marking National Education Week with a heavy focus on the affordability of higher education. The head of a British tech startup spoke about working with colleges to lower costs and improve student performance. For some people, the holidays are all about relaxing at home. If you have extra time on your hands, do yourself a favor and organize your messy photo collection. Tap or click to see how I get the job done. Are you visiting family? Look for your favorite old photos hanging on their walls or tucked away in albums. Tap or click for an app to scan them without any glare. And if you laughed at the words \"extra time,\" I’m here for you, too. Here are a handful of simple ways to get through the holidays with a smile on your face. Stop arguing about when to leave The classic holiday battle: What time should you leave the house to get to your destination on time and avoid traffic? Stop guessing and let traffic-predicting algorithms make your drive easier. Google Maps and Apple Maps offer options to help you plan your trip. Google Maps. (Nikolas Kokovlis/NurPhoto via Getty Images) PROTECT YOUR PRIVACY, YOUR CELL PHONE NUMBER AND EMAIL ADDRESS You can get a pretty accurate traffic forecast for a future date based on what the conditions are like on that day and time. Then you can fine-tune your departure time to find the ideal time to hit the road. Here’s how to set a planned time and date for a trip in Google Maps: Open Google Maps and tap on the Search here field. Enter a destination and select it from the results. Tap Directions and then tap the three-dots button to the right of the Your location field. Tap Set depart or arrive time . Select Depart at and enter a date and time, then tap Done . You’ll get various route options and details such as time and distance. Select a route and tap Start . Tap or click here to find out the best time to leave based on when you want to arrive — and steps to do both in Apple Maps. Keep an eye on your luggage Losing your bag on a flight is a drag, and it's even worse when you have gifts tucked in your bag. Knowing where your suitcase is is easy as long as you have a tracker inside. Apple AirTags are quarter-sized trackers that use Bluetooth from other iPhones to determine where they are. You can see the location of every AirTag associated with your account using the Find My app. The quarter-sized Apple device allows users to keep track of their personal items via Bluetooth technology. (Melina Mara/The Washington Post via Getty Images) Tile trackers work similarly and are a good option for Android users. It's a good idea to throw one in your checked baggage. This way, you can see whether your bag makes it to your destination. But there is a time when the tracker is worthless: When your luggage travels through the airport's inner conveyor belt system. Once your luggage is out of there, you'll know exactly where it's located. I have AirTags on my keys, in my cars and on my dog. Tap or click for smart ways to get more out of these useful little trackers. Make virtual gatherings enjoyable It's not always possible to see the whole family each year. Virtual gatherings are much easier to organize since we got used to them during the pandemic. Don’t spend a Zoom or Google Meet call wishing everyone would stop arguing about politics. Here are three simple ways to liven up your online get-together: Give everyone time to talk: Choose a prompt and tell your family members to be ready to speak for a few minutes. I suggest a time cap, so your more loquacious relatives don’t go on and on. My favorite is asking for funny family stories. Play a game together: Bingo is always a hit, and you can pass out cards for free from this site . If you prefer a Pictionary-like game, try Drawasaurus . Up to 16 people can play. Host a talent show: If your family is full of performers, rope everyone into a short performance. I can guarantee a lot of laughs and maybe even a knockout performance or two. Jingle bell rock together: How to create and share holiday playlists with loved ones . HOW TO SCAN A QR CODE WITH YOUR IPHONE OR ANDROID PHONE (NO APPS NEEDED) Don’t overpay on Amazon Ever wonder if the price you see on Amazon is the best price or — the moment you check out — that price will drop? That’s where CamelCamelCamel comes in. It’s a price-comparison site that tracks the cost of millions of products on Amazon. You can use it to check if the item you’re considering is at a good price or if you should wait for a better deal. Here’s how it works: Go to camelcamelcamel.com. Enter a product’s Amazon URL in the search bar, then hit enter or the search icon . Look at the graph for trends. You might notice a product typically goes on sale during certain months or around the holidays. To make deal hunting even easier, install the CamelCamelCamel browser extension, The Camelizer. Tap or click here for direct links to download and the steps to use it. For everything else, compare prices here Google Shopping. (Photo Illustration by Igor Golovniov/SOPA Images/LightRocket via Getty Images) No one has time to go from site to site or to a bunch of different physical stores to find the best price on something. Let Google Shopping do the hard work for you. It's easy to use and shows you prices across just about any retailer you can think of. Go to shopping.google.com . Browse popular items, or search for what you’re looking for. Hit enter to see where you can buy it, the price and shipping options. Use the filters on the left side of the page to narrow down your results. You can filter by sales, items available for pickup nearby, and more. Here’s a nice bonus: You can even buy things right there without having to make a new account if you have payment info tied to your Google account . Select the Buy on Google filter to see your options. Google smarts: 10 search tricks to find what you’re looking for faster on Google . MY PODCAST PICK: AirPods as hearing aids, PayPal warning, Twitter alternatives In 30 minutes, you’ll learn 1: How to find the hidden privacy report in your phone, 2: The secret to kicking moochers out of your Netflix account, and 3: My tried-and-true method for cleaning up your messy photo gallery. CLICK TO GET THE FOX NEWS APP Try my podcast \"Kim Komando Today\" on Apple , Google Podcasts , Spotify , or your favorite podcast player. Get more tech know-how on The Kim Komando Show , broadcast on 425+ radio stations and available as a podcast . Sign up for Kim’s 5-minute free morning roundup for the latest security breaches and tech news. Need help? Drop your question for Kim here . Copyright 2023, WestStar Multimedia Entertainment. All rights reserved. By clicking the shopping links, you’re supporting my research. As an Amazon Associate, I earn a small commission from qualifying purchases. I only recommend products I believe in.",
        "link": "https://www.foxnews.com/tech/quick-tech-tricks-make-busy-holiday-season-easier",
        "probability_title": {
            "pos": 0.738552319104409,
            "neg": 0.261447680895591
        },
        "probability_description": {
            "pos": 0.8265350527536708,
            "neg": 0.17346494724632927
        }
    },
    {
        "title": "ESA announces new astronaut class",
        "image": null,
        "video": null,
        "description": "ESA has selected its first new astronauts in more than a decade, although long-term flight opportunities for the agency’s astronaut corps remain uncertain. The post ESA announces new astronaut class appeared first on SpaceNews.",
        "content": null,
        "link": "https://spacenews.com/esa-announces-new-astronaut-class/",
        "probability_title": {
            "pos": 0.5801331119770781,
            "neg": 0.41986688802292194
        },
        "probability_description": {
            "pos": 0.6270039558408769,
            "neg": 0.37299604415912313
        }
    },
    {
        "title": "Pokémon Scarlet and Violet hit 10M in sales in first three days",
        "image": null,
        "video": null,
        "description": "The latest Pokémon titles to hit the stores are selling exceptionally well if Nintendo's sales figures are to be believed.",
        "content": "The latest Pokémon titles to hit the stores are selling exceptionally well if Nintendo's sales figures are to be believed.Read More",
        "link": "https://venturebeat.com/games/pokemon-scarlet-and-violet-hit-10m-in-sales-in-first-three-days/",
        "probability_title": {
            "pos": 0.5408503692911217,
            "neg": 0.45914963070887826
        },
        "probability_description": {
            "pos": 0.7736653907500205,
            "neg": 0.2263346092499795
        }
    },
    {
        "title": "Media frets about Musk, ignores the real national security threat: TikTok",
        "image": "https://twt-thumbs.washtimes.com/media/image/2022/11/23/B1_Sadler_Thursday1_s509x929.jpg?d6bd0313d0e3a6266dde3369d4870480edd80a42",
        "video": null,
        "description": "Free speech absolutist Elon Musk has the mainstream media terrified.",
        "content": "Print Commentary By Kelly Sadler - The Washington Times - Wednesday, November 23, 2022 OPINION: Free speech absolutist Elon Musk has the mainstream media terrified. After Mr. Musk purchased Twitter, laid off half the social media network’s workforce, and reinstated formerly banned accounts (like those of former President Donald Trump and Rep. Marjorie Taylor Greene), the barons of the press became unhinged at the notion that they would no longer be able to control the narrative. They framed their coverage as the dangerous spread of “misinformation” and warned that dissenting points of view aired in the digital square are a grave threat to democracy. They want Twitter’s old censorship regime back — and they want it bad. CBS News briefly vacated the social media app out of “an abundance of caution.” Think pieces in The Atlantic, the Daily Beast, NPR and The Guardian advised users to get off the app, recommended liberal alternatives, and suggested that Mr. Musk himself may be a threat to U.S. national security. President Biden was even asked in a press conference earlier this month if the federal government should investigate Mr. Musk’s $44 billion acquisition of the social messaging site. Mr. Biden responded that Mr. Musk’s “cooperation and/or technical relationships with other countries [are] worthy of being looked at,” adding there were “a lot of ways” for the federal government to investigate the Silicon Valley tycoon. If only the press would whip themselves into a similar frenzy about social media’s most menacing actor — Chinese-owned TikTok. On “Fox News Sunday,” Republican Sen. Tom Cotton of Arkansas and Democratic Sen. Mark Warner of Virginia sounded a rare note of bipartisan agreement — TikTok, the short-form video app that is wildly popular with younger users, is indeed a real threat to our national security. “TikTok, a Chinese company, is subject to Communist China’s laws and TikTok is one of the most massive surveillance programs ever, especially on America’s young people,” Mr. Cotton explained. “It’s not just the contents you upload to TikTok, but all the data on your phone and other apps, all your personal information, even facial imagery, even where your eyes are looking on your phone. “That’s why I’ve encouraged every American, if they’re using TikTok, to delete it from their phone. And if they can, to get a new phone altogether,” Mr. Cotton explained. Mr. Warner, who chairs the Senate Intelligence Committee, strongly agreed. “I mean, TikTok is an enormous threat,” he explained. “It’s a threat on two levels. One, it is a massive collector of information, oftentimes of our children. [TikTok operators] can visualize even down to your keystrokes.” Mr. Warner continued: “The second problem is that TikTok, in a sense, is a broadcasting network. And … TikTok, at the end of the day, has to be reliant on the Communist Party. The China law states that.” Through TikTok, he added, Beijing could “dial up the fact that we are going to decrease content that criticizes Chinese leadership but increase the content that your kids may be seeing, saying, ‘Hey, you know, Taiwan really is part of China.’ That is a distribution model that would make RT or Sputnik or some of the Russian propaganda models pale in comparison,” Mr. Warner said. Twitter has plateaued at about 300 million monthly users, whereas TikTok has more than 1 billion, with over 135 million in the U.S. alone. TikTok is the fastest-growing app in American history, in the past two years achieving the metrics other social media companies required 10 to 15 years to achieve. Twitter is largely dominated by media users, with 25% of its users creating 97% of all tweets, according to a Pew Research study. Only 1 in 5 U.S. adults are on Twitter, and they’re much more Democratic-leaning. The average user spends 35 minutes a day on the app. TikTok, by contrast, focuses on our youth. It’s the No. 1 social media app used by those aged 16-25, with Generation Z making up 60% of its user base. Users spend a whopping average of 91 minutes a day on the site. “TikTok users continue to give away personal information to an app with known links to the Chinese government and ‘aggressive’ data-harvesting tactics,” reported UnHerd, a British news website. “TikTok tracks and collects users’ locations, IP addresses, calendars, contact lists, browsing and search histories, the videos they watch and how long they watch them, sharing all this with more third parties than any other app.” In June, BuzzFeed News reported leaked audio of more than 80 internal TikTok meetings that uncovered its China-based employees had repeatedly accessed U.S. user data. TikTok is one of the only Silicon Valley firms not cutting employees in the economic downturn, vowing to hire 1,000 ,pre this month. Mr. Cotton has asked the Department of Homeland Security to release information about the hundreds of foreign employees working in TikTok’s U.S. offices, saying that many of the guest workers in the U.S. may have direct ties to the Chinese Communist Party. In August 2020, Mr. Trump signed an executive order that moved to ban TikTok. Last year, Mr. Biden inexplicably revoked it. Although CBS News briefly shuttered its Twitter account, it maintained its TikTok account. It’s rare to read think pieces about TikTok not printed in trade journals. Mr. Biden thinks Mr. Musk should be investigated, yet his administration’s examination of the inner workings of TikTok is at a standstill. The bottom line: For some liberals — especially those within the news media — conservative voices, not those who run Communist China, represent the greatest security threat to America. • Kelly Sadler is the commentary editor at The Washington Times. Copyright © 2022 The Washington Times, LLC. Click here for reprint permission . Please read our comment policy before commenting. Click to Read More and View Comments Click to Hide",
        "link": "https://www.washingtontimes.com/news/2022/nov/23/media-frets-about-musk-ignores-real-national-secur/?utm_source=RSS_Feed&utm_medium=RSS",
        "probability_title": {
            "pos": 0.7198886190945453,
            "neg": 0.28011138090545473
        },
        "probability_description": {
            "pos": 0.8699354642369116,
            "neg": 0.1300645357630884
        }
    },
    {
        "title": "Black Friday Deals live now: Telescopes, VR headsets, Lego and more",
        "image": "http://cdn.mos.cms.futurecdn.net/cBi886Gf7N9Bdkmw7VgyDL.jpg",
        "video": null,
        "description": "Our Black Friday space deals coverage is underway with the freshest deals on telescopes, star projectors, drones Lego and more.",
        "content": null,
        "link": "https://www.space.com/news/live/black-friday-deals-2022",
        "probability_title": {
            "pos": 0.6515514830123961,
            "neg": 0.3484485169876039
        },
        "probability_description": {
            "pos": 0.6048589874623391,
            "neg": 0.3951410125376608
        }
    },
    {
        "title": "A radical new approach in synthetic chemistry",
        "image": "https://scx1.b-cdn.net/csz/news/tmb/2022/a-radical-new-approach.jpg",
        "video": null,
        "description": "Scientists at the U.S. Department of Energy's (DOE) Brookhaven National Laboratory helped measure how unpaired electrons in atoms at one end of a molecule can drive chemical reactivity on the molecule's opposite side. As described in a paper recently published in the Journal of the American Chemical Society, this work, in collaboration with Princeton University, shows how molecules containing these so-called free radicals could be used in a whole new class of reactions.",
        "content": null,
        "link": "https://phys.org/news/2022-11-radical-approach-synthetic-chemistry.html",
        "probability_title": {
            "pos": 0.36769346835068406,
            "neg": 0.6323065316493159
        },
        "probability_description": {
            "pos": 0.7224876465259955,
            "neg": 0.27751235347400455
        }
    },
    {
        "title": "Study uncovers how bacteria use ancient mechanisms to self-repair",
        "image": "https://scx1.b-cdn.net/csz/news/tmb/2022/bacteria-use-ancient-m-2.jpg",
        "video": null,
        "description": "A new study led by UNSW Sydney scientists unveils how nature's oldest wheel, found within bacteria, can fix itself when times get tough.",
        "content": null,
        "link": "https://phys.org/news/2022-11-uncovers-bacteria-ancient-mechanisms-self-repair.html",
        "probability_title": {
            "pos": 0.7487846193676702,
            "neg": 0.25121538063232984
        },
        "probability_description": {
            "pos": 0.5735612128800212,
            "neg": 0.4264387871199788
        }
    },
    {
        "title": "Tracking explosions with toughened-up tracers",
        "image": "https://scx1.b-cdn.net/csz/news/tmb/2022/tracking-explosions-wi.jpg",
        "video": null,
        "description": "What happens in an explosion? Where do the products of that explosion go following the blast? These questions are often difficult to solve. New rugged tracer particles, developed by Pacific Northwest National Laboratory (PNNL) researchers, can provide some answers.",
        "content": null,
        "link": "https://phys.org/news/2022-11-tracking-explosions-toughened-up-tracers.html",
        "probability_title": {
            "pos": 0.7268073906961205,
            "neg": 0.2731926093038794
        },
        "probability_description": {
            "pos": 0.742231895820338,
            "neg": 0.25776810417966195
        }
    },
    {
        "title": "Hulu Black Friday Deal - Get one year for just $1.99 per month",
        "image": "http://cdn.mos.cms.futurecdn.net/ZgfprhY6xKjyA27byz3mCa.png",
        "video": null,
        "description": "Hulu has a fantastic selection of sci-fi and space-themed shows and movies streaming for just $1.99 a month during this Black Friday 2022 deal.",
        "content": null,
        "link": "https://www.space.com/hulu-black-friday-deal-2022",
        "probability_title": {
            "pos": 0.5686668161647395,
            "neg": 0.43133318383526054
        },
        "probability_description": {
            "pos": 0.6335378894406256,
            "neg": 0.36646211055937433
        }
    },
    {
        "title": "Report: 72% of U.S. workers want to delegate mundane tasks to AI",
        "image": null,
        "video": null,
        "description": "72% of U.S. employees say they'd like to delegate mundane tasks like invoice management, auditing and simple reporting to AI so they can focus on tasks that help them grow at work.",
        "content": "72% of U.S. employees say they'd like to delegate mundane tasks like invoice management, auditing and simple reporting to AI so they can focus on tasks that help them grow at work.Read More",
        "link": "https://venturebeat.com/ai/72-of-u-s-workers-want-to-delegate-mundane-tasks-to-ai/",
        "probability_title": {
            "pos": 0.6818547896516265,
            "neg": 0.31814521034837345
        },
        "probability_description": {
            "pos": 0.7742589604612586,
            "neg": 0.2257410395387413
        }
    },
    {
        "title": "New research improves the coolness factor for athletes",
        "image": "https://scx1.b-cdn.net/csz/news/tmb/2022/new-research-improves.jpg",
        "video": null,
        "description": "Weekend joggers, competitive athletes and people keeping fit in the gym can say goodbye to sweaty armpits and clingy damp garments after a tough workout.",
        "content": null,
        "link": "https://phys.org/news/2022-11-coolness-factor-athletes.html",
        "probability_title": {
            "pos": 0.5231860265266515,
            "neg": 0.4768139734733485
        },
        "probability_description": {
            "pos": 0.6630651628051762,
            "neg": 0.3369348371948237
        }
    },
    {
        "title": "American media's embarrassingly self righteous coverage of the World Cup",
        "image": "https://twt-thumbs.washtimes.com/media/image/2022/11/23/WCup_Belgium_Canada_Soccer_13695--b5499_s1440x961.jpg?6ffc4d3d57b058013256ad5bbd6d52434af2a762",
        "video": null,
        "description": "Soccer isn't the most popular sport in the United States. In fact, it's not even close. Football, baseball and basketball dominate the television viewing habits of Americans. The NFL's Super Bowl is America's largest annual television event with an audience of more than 110 million people each year.",
        "content": null,
        "link": "https://www.washingtontimes.com/news/2022/nov/23/american-medias-embarrassingly-self-righteous-cove/?utm_source=RSS_Feed&utm_medium=RSS",
        "probability_title": {
            "pos": 0.7666202915732585,
            "neg": 0.2333797084267415
        },
        "probability_description": {
            "pos": 0.7698522179185417,
            "neg": 0.23014778208145825
        }
    },
    {
        "title": "Gully erosion prediction tools can lead to better land management",
        "image": "https://scx1.b-cdn.net/csz/news/tmb/2015/soil.jpg",
        "video": null,
        "description": "Soil erosion is a significant problem for agricultural production, impacting soil quality and causing pollutants to enter waterways. Among all stages of soil erosion, gully erosion is the most severe phase, where large channels are carved through the field. Once gullies develop, they are challenging to manage through tiling; they require a more comprehensive approach along the impacted area.",
        "content": null,
        "link": "https://phys.org/news/2022-11-gully-erosion-tools.html",
        "probability_title": {
            "pos": 0.6717912823529648,
            "neg": 0.32820871764703513
        },
        "probability_description": {
            "pos": 0.7436515688869176,
            "neg": 0.2563484311130823
        }
    },
    {
        "title": "Low-cost sensor records the level of rivers",
        "image": "https://scx1.b-cdn.net/csz/news/tmb/2022/low-cost-sensor-record.jpg",
        "video": null,
        "description": "Researchers at the University of Bonn have developed a method that allows the water level of rivers to be monitored around the clock. The cost-effective sensor is for instance suitable for area-wide flood warning systems. The study has been published in the journal Water Resources Research.",
        "content": null,
        "link": "https://phys.org/news/2022-11-low-cost-sensor-rivers.html",
        "probability_title": {
            "pos": 0.7745027135709199,
            "neg": 0.22549728642908
        },
        "probability_description": {
            "pos": 0.7402575769045319,
            "neg": 0.25974242309546813
        }
    },
    {
        "title": "Balenciaga Apologized For A Photo Shoot That Included Kids Holding Bears In BDSM Gear And People Are Not Having It",
        "image": "https://img.buzzfeed.com/buzzfeed-static/static/2022-11/23/20/asset/ca26507fc509/sub-buzz-3274-1669236921-18.png?resize=625:636",
        "video": null,
        "description": "Balenciaga says it’s investigating how ads featuring “unsettling documents” became part of a campaign involving children.View Entire Post ›",
        "content": "Internet Culture Balenciaga Apologized For A Photo Shoot That Included Kids Holding Bears In BDSM Gear And People Are Not Having It Balenciaga says it’s investigating how ads featuring “unsettling documents” became part of a campaign involving children. By by Kelsey Weekman BuzzFeed News Reporter Posted 2 hours ago Twitter Facebook Link Balenciaga French luxury brand Balenciaga apologized for its advertising campaign that showed two young children posing with bears wearing BDSM-style harnesses and featured court documents that mentioned “virtual child porn.” “We sincerely apologize for any offense our holiday campaign may have caused. Our plush bear bags should not have been featured with children in this campaign,” the company said in a statement posted to its Instagram story on Tuesday. “We have immediately removed the campaign from all platforms.” Two hours later, a second statement appeared on the company’s Instagram story: “We apologize for displaying unsettling documents in our campaign. We take this matter very seriously and are taking legal action against the parties responsible for creating the set and including unapproved items for our Spring 23 campaign photoshoot. We strongly condemn abuse of children in any form. We stand for children safety and well-being.” The advertisements, which promoted Balenciaga’s Spring/Summer 2023 collection, have been removed from the company’s website and wiped from social media. Balenciaga Conservative commentators were quick to sound the alarm on Monday, accusing the company of platforming “groomers,” sexualizing children , and producing “child pornography.” Some Twitter users pointed out “demonic” elements, like blacked-out eyes and the name of the demon “Baal.” Right-wing personalities were also quick to use the Balanciaga photos to make anti-trans and anti-gay remarks. On Fox News, Tucker Carlson said he thought the ad was part of a larger trend of “adults crossing the line…into deep involvement with the sexuality of children,” adding a hateful comment about trans children. In a tweet , Ben Shapiro tied the ads to the presence of BDSM gear at Pride parades. The anti-LGBTQ reaction on right-wing media to the Balenciaga campaign comes after months of focus by conservative media on dismantling LGBTQ rights. It also comes just days after someone stormed into a gay club in Colorado Springs on Saturday night, shooting and killing five people and injuring another 18. The incident is being investigated as a hate crime. Two of the dead were trans. As the backlash against Balenciaga continued, the company’s apology directly condemned the content of the ads and detailed the brand’s plans to investigate how they came to be. Many of the 130,000 tweets about Balenciaga that have been posted in the past few days show that people don’t think the apology is good enough, however. “Balenciaga is very much cancelled in my eyes, I don’t care what explanation they come up with. don’t mess with children,” one Twitter user wrote on Tuesday. tori @voguepearls if balenciaga took this matter so seriously they never would’ve published that campaign or come up with the concept in the first place 09:39 PM - 22 Nov 2022 Reply Retweet Favorite Twitter: @voguepearls 𝓐𝓷𝓰𝓮𝓵 ☁️🏹 @angelmillk I cannot believe Balenciaga just- who signed off???? Who’s idea was it even because they need to be in jail. This is concerning. Horrifying. 04:49 PM - 21 Nov 2022 Reply Retweet Favorite Twitter: @angelmillk Tori Nicks 2.0 🛰 @MajestyRia Most people are going to ignore the Balenciaga ad just to avoid speaking out against it. In a few weeks, most people won’t even remember & it’ll be business as usual for them & in a few years, Balenciaga will try again.. in a new way. 04:43 PM - 21 Nov 2022 Reply Retweet Favorite Twitter: @MajestyRia CJ Pearson @thecjpearson Balenciaga isn’t apologizing for what they did. Balenciaga is apologizing because they got caught. Don’t confuse the two. 02:21 AM - 23 Nov 2022 Reply Retweet Favorite Twitter: @thecjpearson Exodus Cry, a Christian advocacy group that opposes sex work and pornography, said in a statement sent to BuzzFeed News that Balenciaga’s apology was a “collective win for everyone who called out the billion dollar company.” “It’s clear that Balenciaga got the message: it’s NEVER OKAY to sexualize children,” the statement said. “We know this will serve as a lesson to many other companies, whether large or small, who are tempted to introduce similar disturbing themes into their products or advertising.” Balenciaga was one of many companies to cut ties with Kanye West in October after he made antisemitic remarks, which conservative commenters brought up. Some people, like conservative commentator Candace Owens, called on longtime Balenciaga fan Kim Kardashian to speak out. Others implied that what West did was not as bad as this. CJ Pearson @thecjpearson Balenciaga severed their ties with @kanyewest due to a tweet. Yet they expect us to just “accept their apology” after they get caught up sexualizing children? They’re not apologizing because they’re sorry. They’re apologizing because they got caught. 10:18 PM - 22 Nov 2022 Reply Retweet Favorite Twitter: @thecjpearson Royce White 🇺🇸 @Highway_30 So Balenciaga drops Kanye West (Mr. Sunday Service) and then proceeds to release it’s child pornography campaign? How far are we going to let this shit go? Honestly? These people are psychotic and I’m starting to think a lot of y’all like watching. Who’s voting for these weirdos? 05:51 AM - 22 Nov 2022 Reply Retweet Favorite Twitter: @Highway_30 Lin Mei @linmeitalks Funny how Balenciaga made reference to child porn while using a child model holding a teddy with a bondage outfit on and they won’t be “cancelled” but Kanye had his bank account frozen and lost multiple deals / money and Kyrie had to do 5 or 6 actions to prove he was sorry. 12:28 AM - 23 Nov 2022 Reply Retweet Favorite Twitter: @linmeitalks More on this The Colorado Springs Shooting Was Always Going To Happen David Mack · Nov. 21, 2022 How The “Don’t Say Gay” Law Is Affecting Florida LGBTQ Students And Teachers Hallie Lieberman · Nov. 18, 2022 Puberty Blockers, Hormones, And Gender Affirmation Surgery Are No Longer Available To Florida Minors Seeking Treatment Steffi Cao · Nov. 5, 2022 Topics in this article Internet Culture viral moments Kelsey Weekman BuzzFeed News Reporter Kelsey Weekman is a reporter for BuzzFeed News and is based in New York. Contact Kelsey Weekman at kelsey.weekman@buzzfeed.com . Got a confidential tip? 👉 Submit it here",
        "link": "https://www.buzzfeednews.com/article/kelseyweekman/balenciaga-teddy-bear-ad-response",
        "probability_title": {
            "pos": 0.7119033408492257,
            "neg": 0.28809665915077426
        },
        "probability_description": {
            "pos": 0.8418719418984308,
            "neg": 0.15812805810156916
        }
    },
    {
        "title": "Can we protect Earth from space weather?",
        "image": "https://scx1.b-cdn.net/csz/news/tmb/2022/space-1.jpg",
        "video": null,
        "description": "In early September 1859, the Northern Lights could suddenly be seen as far south as the Caribbean. The cause was a geomagnetic solar storm—specifically a coronal mass ejection, now dubbed the Carrington Event, after the astronomer who recorded it.",
        "content": null,
        "link": "https://phys.org/news/2022-11-earth-space-weather.html",
        "probability_title": {
            "pos": 0.6407320325697208,
            "neg": 0.35926796743027917
        },
        "probability_description": {
            "pos": 0.8118646472057645,
            "neg": 0.1881353527942355
        }
    },
    {
        "title": "NET locus regulates both flavor quality and nutrient metabolite accumulation in rice",
        "image": "https://scx1.b-cdn.net/csz/news/tmb/2022/the-net-locus-regulate.jpg",
        "video": null,
        "description": "Rice (Oryza sativa L.) is one of the most important crops worldwide, providing much of the calorific needs for half of the global population. Economic development and rising living standards have led to the demand for rice gradually shifting from satisfying the need to \"be full\" to satisfying the need to \"eat well,\" and combining flavor with nutrition is essential for the latter. Much research has focused on improving the eating and cooking quality (ECQ) of rice to meet the demand for \"tasty.\" However, effort to improve comprehensive nutrition in rice remains fragmented.",
        "content": null,
        "link": "https://phys.org/news/2022-11-net-locus-flavor-quality-nutrient.html",
        "probability_title": {
            "pos": 0.607111730645414,
            "neg": 0.392888269354586
        },
        "probability_description": {
            "pos": 0.7791557013694462,
            "neg": 0.22084429863055377
        }
    },
    {
        "title": "Scientists add 'invisible fiber' to foods for a healthier diet",
        "image": "https://scx1.b-cdn.net/csz/news/tmb/2022/bread.jpg",
        "video": null,
        "description": "Scientists have converted native starches such as wheat, corn and cassava to dietary fiber that can be added to food to make it healthier without changing its texture, color or taste.",
        "content": null,
        "link": "https://phys.org/news/2022-11-scientists-invisible-fiber-foods-healthier.html",
        "probability_title": {
            "pos": 0.6556042817186976,
            "neg": 0.3443957182813024
        },
        "probability_description": {
            "pos": 0.7710579903003469,
            "neg": 0.228942009699653
        }
    },
    {
        "title": "Synthetic fibers discovered in Antarctic air, seawater, sediment and sea ice",
        "image": "https://scx1.b-cdn.net/csz/news/tmb/2022/synthetic-fibers-disco-1.jpg",
        "video": null,
        "description": "As nations meet in Uruguay to negotiate a new Global Plastics Treaty, marine and forensic scientists publish new results this week that reveal the discovery of synthetic plastic fibers in air, seawater, sediment and sea ice sampled in the Antarctic Weddell Sea. The field research was undertaken during an expedition to discover Sir Ernest Shackleton's ship, the Endurance. The results are published in the journal Frontiers in Marine Science.",
        "content": null,
        "link": "https://phys.org/news/2022-11-synthetic-fibers-antarctic-air-seawater.html",
        "probability_title": {
            "pos": 0.607111730645414,
            "neg": 0.392888269354586
        },
        "probability_description": {
            "pos": 0.6093127185834257,
            "neg": 0.39068728141657433
        }
    },
    {
        "title": "Old World flycatchers' family tree mapped",
        "image": "https://scx1.b-cdn.net/csz/news/tmb/2022/old-world-flycatchers.jpg",
        "video": null,
        "description": "The European robin's closest relatives are found in tropical Africa. The European robin is therefore not closely related to the Japanese robin, despite their close similarity in appearance. This is confirmed by a new study of the Old World flycatcher family, to which these birds belong. The study comprises 92 percent of the more than 300 species in this family.",
        "content": null,
        "link": "https://phys.org/news/2022-11-world-flycatchers-family-tree.html",
        "probability_title": {
            "pos": 0.6575840196287691,
            "neg": 0.3424159803712309
        },
        "probability_description": {
            "pos": 0.6623137910168291,
            "neg": 0.3376862089831709
        }
    },
    {
        "title": "New technology maps movement of microscopic algae in unprecedented detail",
        "image": "https://scx1.b-cdn.net/csz/news/tmb/2022/new-technology-maps-mo.jpg",
        "video": null,
        "description": "The movement patterns of microscopic algae can be mapped in greater detail than ever before, giving new insights into ocean health, thanks to new technology developed at the University of Exeter.",
        "content": null,
        "link": "https://phys.org/news/2022-11-technology-movement-microscopic-algae-unprecedented.html",
        "probability_title": {
            "pos": 0.5667317496120212,
            "neg": 0.4332682503879788
        },
        "probability_description": {
            "pos": 0.6855985116750902,
            "neg": 0.3144014883249098
        }
    },
    {
        "title": "Thanksgiving 2022: Be thankful for everything in your life",
        "image": "https://twt-thumbs.washtimes.com/media/image/2022/11/23/B1_McKenna3_s867x929.jpg?5e9d53deccbb54262d60bf3c85180155e715e0e6",
        "video": null,
        "description": "In 1621, Richard Warren, almost certainly a refugee from debtors prison, scuffled to survive on the western edge of the North Atlantic along with the Pilgrims at Plymouth.",
        "content": null,
        "link": "https://www.washingtontimes.com/news/2022/nov/23/thanksgiving-2022-be-thankful-for-everything-in-yo/?utm_source=RSS_Feed&utm_medium=RSS",
        "probability_title": {
            "pos": 0.6293608807629756,
            "neg": 0.3706391192370244
        },
        "probability_description": {
            "pos": 0.7586606917653952,
            "neg": 0.2413393082346048
        }
    },
    {
        "title": "The arc of insecurity in the Horn of Africa and new breakthroughs",
        "image": "https://www.brookings.edu/wp-content/uploads/2022/11/2022-11-03T150156Z_1726569825_RC2SDX9OUT7F_RTRMADP_3_ETHIOPIA-CONFLICT-CHALLENGES.jpg?w=288",
        "video": null,
        "description": "Long battered by dangerous wars, militancy, and humanitarian catastrophes — including an ongoing hunger crisis — the Horn of Africa seems to be experiencing significant security breakthroughs. After two years of intense fighting, the conflict between the Tigray and Ethiopian government forces seems close to being resolved, with an important ceasefire and negotiated peace deal…",
        "content": "Long battered by dangerous wars, militancy, and humanitarian catastrophes — including an ongoing hunger crisis — the Horn of Africa seems to be experiencing significant security breakthroughs. After two years of intense fighting, the conflict between the Tigray and Ethiopian government forces seems close to being resolved, with an important ceasefire and negotiated peace deal reached. Its implementation will be critical for lasting peace and recovery in Ethiopia. In Somalia, the new government of President Hassan Sheikh Mohamud has prioritized taking on Al-Shabab, capitalizing on local anti-Shabab clan militia uprisings. But Al-Shabab remains entrenched, and many other security challenges remain. In Kenya, the new government of President William Ruto will become a strong factor in the Horn’s security. Yet the regional environment remains complex, with actors such as Eritrea, the United Arab Emirates, Saudi Arabia, and Turkey capable of either anchoring or destabilizing security gains. Moreover, the arc of insecurity in East Africa runs long and deep into southern Tanzania and Mozambique, two of Africa’s many areas where jihadi insurgencies are far from resolved. On December 6, join the Brookings Initiative on Nonstate Armed Actors and the Africa Security Initiative to discuss the various security challenges affecting the Horn and explore the region’s current breakthroughs and future opportunities. After their remarks, panelists will take questions from the audience. Viewers can submit questions via email to events@brookings.edu or Twitter using #HornofAfrica.",
        "link": "https://www.brookings.edu/events/the-arc-of-insecurity-in-the-horn-of-africa-and-new-breakthroughs/",
        "probability_title": {
            "pos": 0.5859877369987079,
            "neg": 0.4140122630012922
        },
        "probability_description": {
            "pos": 0.7439074068573253,
            "neg": 0.2560925931426748
        }
    },
    {
        "title": "Jenna Ortega on Making Wednesday Addams Her Own In 'Wednesday,' and Keeping the Horror Genre Alive",
        "image": "https://img.buzzfeed.com/buzzfeed-static/static/2022-11/23/21/tmp/ebca4e60a019/tmp-name-3-3436-1669237354-0_dblbig.jpg",
        "video": null,
        "description": "Complex caught up with Jenna Ortega ahead of the 'Wednesday' premiere, and she opened up about adding depth to the character, working with Tim Burton, and more.View Entire Post ›",
        "content": null,
        "link": "https://www.complex.com/pop-culture/a/karla-rodriguez/jenna-ortega-wednesday-netflix-interview",
        "probability_title": {
            "pos": 0.7236016932971325,
            "neg": 0.2763983067028674
        },
        "probability_description": {
            "pos": 0.8035447344271852,
            "neg": 0.19645526557281479
        }
    },
    {
        "title": "Mars rover documentary 'Good Night Oppy' now streaming on Prime Video",
        "image": "http://cdn.mos.cms.futurecdn.net/MZkHwweEsQ95meQNp4MtsH.jpg",
        "video": null,
        "description": "\"Good Night Oppy\" finally arrives on Amazon's Prime Video streaming service on Wednesday (Nov. 23), just in time for holiday viewing over the long Thanksgiving Day weekend.",
        "content": null,
        "link": "https://www.space.com/good-night-oppy-mars-rover-documentary-now-streaming-prime-video-nov-23",
        "probability_title": {
            "pos": 0.7198254071321959,
            "neg": 0.2801745928678041
        },
        "probability_description": {
            "pos": 0.7787463736858681,
            "neg": 0.22125362631413192
        }
    }
]
